CCS-POT-RANDOM-READ.
    MOVE WS-POT-ORG             TO P-ORG-NMBR.
    MOVE WS-POT-TYPE            TO P-TYPE-NMBR.
    MOVE WS-POT-OCC             TO P-SELECTION.
    READ PRODUCT-OFFERING-FILE.
    IF  WS-CPPOT-STATUS IS EQUAL TO 23
        MOVE 4                  TO WS-IO-COMPLETE-SW
    ELSE
        IF  WS-CPPOT-STATUS IS EQUAL TO ZERO
            MOVE 1              TO WS-IO-COMPLETE-SW
        ELSE
            MOVE WS-CPPOT-STATUS
                                TO WS-ABEND-STATUS
            MOVE 5              TO WS-IO-COMPLETE-SW.
CCS-PRR-XIT.
    EXIT.
CCS-POT-NXT-SEQ.
    READ PRODUCT-OFFERING-FILE NEXT.
    IF  WS-CPPOT-STATUS IS EQUAL TO 10
        MOVE 6                  TO WS-IO-COMPLETE-SW
    ELSE
        IF  WS-CPPOT-STATUS IS EQUAL TO ZERO
            MOVE 1              TO WS-IO-COMPLETE-SW
        ELSE
            MOVE WS-CPPOT-STATUS
                                TO WS-ABEND-STATUS
            MOVE 5              TO WS-IO-COMPLETE-SW.
CCS-PNS-XIT.
    EXIT.
CCS-POT-START-GREATER.
    MOVE WS-PRODUCT-OFFR-KEY    TO P-POT-01-KEY
    START PRODUCT-OFFERING-FILE KEY IS GREATER THAN P-POT-01-KEY.
    IF  WS-CPPOT-STATUS IS EQUAL TO ZERO
        PERFORM CCS-POT-NXT-SEQ  THRU  CCS-PNS-XIT
    ELSE
        MOVE WS-CPPOT-STATUS    TO WS-ABEND-STATUS
        MOVE 5                  TO WS-IO-COMPLETE-SW.
CCS-PSG-XIT.
    EXIT.
