CCS-POT-RECORD-ADD.
    WRITE P-O-T-RECORD.
    IF WS-CPPOT-STATUS IS EQUAL TO 22
      MOVE 3 TO WS-IO-COMPLETE-SW
    ELSE
    IF WS-CPPOT-STATUS IS EQUAL TO ZERO
      MOVE 1 TO WS-IO-COMPLETE-SW
    ELSE
    MOVE WS-CPPOT-STATUS TO WS-ABEND-STATUS
    MOVE 5 TO WS-IO-COMPLETE-SW.
CCS-PRA-XIT.
    EXIT.
CCS-POT-UPDATE.
    REWRITE P-O-T-RECORD.
    IF WS-CPPOT-STATUS IS EQUAL TO 23
      MOVE 4 TO WS-IO-COMPLETE-SW
    ELSE
    IF WS-CPPOT-STATUS IS EQUAL TO ZERO
    MOVE 1 TO WS-IO-COMPLETE-SW
    ELSE
    MOVE WS-CPPOT-STATUS TO WS-ABEND-STATUS
    MOVE 5 TO WS-IO-COMPLETE-SW.
CCS-PU-XIT.
    EXIT.
