CCS-SYSTEM-FILE-RANDOM-READ.                                     
    MOVE WS-ORGN-KEY TO CPSYS-ORGN.                              
    MOVE WS-TYPE-KEY TO CPSYS-TYPE.                              
    READ SYSTEM-CONTROL-FILE.                                    
    IF WS-CPSYS-STATUS IS EQUAL TO 23                            
      MOVE 4 TO WS-IO-COMPLETE-SW                                
    ELSE                                                         
    IF WS-CPSYS-STATUS IS EQUAL TO ZERO                          
      MOVE 1 TO WS-IO-COMPLETE-SW                                
    ELSE                                                         
    MOVE WS-CPSYS-STATUS TO WS-ABEND-STATUS                      
    MOVE 5 TO WS-IO-COMPLETE-SW.                                 
CCS-SFRR-XIT.                                                    
    EXIT.                                                        
CCS-SYSTEM-FILE-NEXT-SEQ.                                        
    READ SYSTEM-CONTROL-FILE NEXT.                               
    IF WS-CPSYS-STATUS IS EQUAL TO 10                            
      MOVE 6 TO WS-IO-COMPLETE-SW                                
    ELSE                                                         
    IF WS-CPSYS-STATUS IS EQUAL TO ZERO                          
      MOVE 1 TO WS-IO-COMPLETE-SW                                
    ELSE                                                         
    MOVE WS-CPSYS-STATUS TO WS-ABEND-STATUS                      
    MOVE 5 TO WS-IO-COMPLETE-SW.                                 
CCS-SFNS-XIT.                                                    
    EXIT.                                                        
CCS-SYSTEM-START.                                                
    MOVE WS-SYS-KEY TO CPSYS-01-KEY.                             
    START SYSTEM-CONTROL-FILE KEY IS EQUAL TO CPSYS-01-KEY.      
    IF WS-CPSYS-STATUS IS EQUAL TO ZERO                          
      PERFORM CCS-SYSTEM-FILE-NEXT-SEQ  THRU  CCS-SFNS-XIT       
    ELSE                                                         
    MOVE 5 TO WS-IO-COMPLETE-SW                                  
    MOVE WS-CPSYS-STATUS TO WS-ABEND-STATUS.                     
CCS-SS-XIT.                                                      
    EXIT.                                                        
CCS-SYSTEM-START-GREATER-THAN.                                   
    MOVE WS-SYS-KEY TO CPSYS-01-KEY.                             
    START SYSTEM-CONTROL-FILE KEY IS GREATER THAN CPSYS-01-KEY.  
    IF WS-CPSYS-STATUS IS EQUAL TO ZERO                          
       PERFORM CCS-SYSTEM-FILE-NEXT-SEQ  THRU  CCS-SFNS-XIT      
    ELSE                                                         
       MOVE 5 TO WS-IO-COMPLETE-SW                               
       MOVE WS-CPSYS-STATUS TO WS-ABEND-STATUS.                  
CCS-SSGT-XIT.                                                    
    EXIT.                                                        
