CCSI-ELAPSED-MONTHS.
    MOVE WS-DTE-DATE-1          TO WS-DTE-JULIAN.
    PERFORM CCSI-JUL-TO-GREG    THRU CCSI-JTG-EXIT.
    COMPUTE WS-DTE-LEAP         = (WS-DTE-YEAR * 12)
                                +  WS-DTE-MM.
    MOVE WS-DTE-DATE-2          TO WS-DTE-JULIAN.
    PERFORM CCSI-JUL-TO-GREG    THRU CCSI-JTG-EXIT.
    COMPUTE WS-DTE-WORK         = (WS-DTE-YEAR * 12)
                                +  WS-DTE-MM.
    COMPUTE WS-DTE-RESULT       =  WS-DTE-LEAP - WS-DTE-WORK.
    IF  WS-DTE-RESULT IS LESS THAN ZERO
        COMPUTE WS-DTE-RESULT   =  WS-DTE-RESULT * -1.
CCSI-EM-EXIT.
    EXIT.
CCSI-ELAPSED-YEARS.
    MOVE WS-DTE-DATE-1          TO WS-DTE-JULIAN.
    MOVE WS-DTE-JULYR           TO WS-DTE-LEAP.
    MOVE WS-DTE-DATE-2          TO WS-DTE-JULIAN.
    MOVE WS-DTE-JULYR           TO WS-DTE-WORK.
    COMPUTE WS-DTE-RESULT       =  WS-DTE-LEAP - WS-DTE-WORK.
    IF  WS-DTE-RESULT IS LESS THAN ZERO
        COMPUTE WS-DTE-RESULT   =  WS-DTE-RESULT * -1.
CCSI-EY-EXIT.
    EXIT.
