CCSI-DATE-VALIDATION.
    MOVE ZERO                   TO WS-DTE-WORK.
    MOVE 'N'                    TO WS-DTE-VALID-SW.
    IF  WS-DTE-ZYEAR-X IS EQUAL TO SPACES
        MOVE WS-DTE-ZDAY-X      TO WS-DTE-ZYEAR-X
        MOVE ZERO               TO WS-DTE-ZDAY.
    IF  WS-DTE-DATE IS NOT NUMERIC
        MOVE ZERO               TO WS-DTE-DATE
        GO TO CCSI-DV-EXIT.
    IF  WS-DTE-DATE IS EQUAL TO ZERO
        MOVE ZERO               TO WS-DTE-DATE-L6
        MOVE ZERO               TO WS-DTE-MDY
        MOVE ZERO               TO WS-DTE-DMY
        MOVE 'Z'                TO WS-DTE-VALID-SW
        GO TO CCSI-DV-EXIT.
    IF  WS-DATE-FORMAT IS EQUAL TO 1
        IF  WS-DTE-DAY IS GREATER THAN ZERO AND
            WS-DTE-DAY IS LESS THAN 13
            SET X-WS-DV-MON     TO WS-DTE-DAY
        ELSE
            MOVE ZERO           TO WS-DTE-DATE
            GO TO CCSI-DV-EXIT
    ELSE
        IF  WS-DTE-MON IS GREATER THAN ZERO AND
            WS-DTE-MON IS LESS THAN 13
            SET X-WS-DV-MON     TO WS-DTE-MON
        ELSE
            MOVE ZERO           TO WS-DTE-DATE
            GO TO CCSI-DV-EXIT.
    IF  WS-DTE-ZDAY IS EQUAL TO ZERO
        IF  WS-DTE-ZYEAR IS LESS THAN 50
            MOVE 20             TO WS-DTE-ZDAY
        ELSE
            MOVE 19             TO WS-DTE-ZDAY.
    COMPUTE WS-DTE-WORK         =  WS-DTE-YEAR * 250.
    IF  WS-DTE-RMDR IS GREATER THAN ZERO OR
        WS-DTE-SPECIAL-LEAP-YEAR-SKIP
        MOVE 28                 TO WS-DV-MON (2)
    ELSE
        MOVE 29                 TO WS-DV-MON (2).
    IF  WS-DATE-FORMAT IS EQUAL TO 1
        IF  WS-DTE-MON IS GREATER THAN ZERO AND
            WS-DTE-MON IS NOT GREATER THAN
                                WS-DV-MON (X-WS-DV-MON)
            NEXT SENTENCE
        ELSE
            MOVE ZERO           TO WS-DTE-DATE
            GO TO CCSI-DV-EXIT
    ELSE
        IF  WS-DTE-DAY IS GREATER THAN ZERO AND
            WS-DTE-DAY IS NOT GREATER THAN
                                WS-DV-MON (X-WS-DV-MON)
            NEXT SENTENCE
        ELSE
            MOVE ZERO           TO WS-DTE-DATE
            GO TO CCSI-DV-EXIT.
    MOVE WS-DTE-MON             TO WS-DTE-MM WS-DTE-DDX.         
    MOVE WS-DTE-DAY             TO WS-DTE-DD WS-DTE-MMX.         
    MOVE WS-DTE-ZYEAR           TO WS-DTE-YY WS-DTE-YYX.
    MOVE 28                     TO WS-DV-MON (2).
    IF  WS-DATE-FORMAT IS EQUAL TO 1
        MOVE WS-DTE-DMY         TO WS-DTE-DATE-L6
    ELSE
        MOVE WS-DTE-MDY         TO WS-DTE-DATE-L6.
    MOVE 'Y'                    TO WS-DTE-VALID-SW.
CCSI-DV-EXIT.
    EXIT.
