CCSI-DAY-OF-WEEK.
    COMPUTE WS-DTE-DATE-1 = WS-DTE-JULYR * .25.
    COMPUTE WS-DTE-WORK = WS-DTE-JULYR * 250.
    IF  WS-DTE-RMDR IS EQUAL TO ZERO
        SUBTRACT 1              FROM WS-DTE-DATE-1.
    COMPUTE WS-DTE-RESULT = WS-DTE-DATE-1 + WS-DTE-JULDAYS
                          + ((WS-DTE-JULYR - 1) * 365).
    DIVIDE 7 INTO WS-DTE-RESULT GIVING WS-DTE-WORK
        REMAINDER WS-DTE-DOW.
    IF  WS-DTE-DOW IS EQUAL TO ZERO
        MOVE 6                  TO WS-DTE-DOW
    ELSE
        SUBTRACT 1              FROM WS-DTE-DOW.
CCSI-DOW-EXIT.
    EXIT.
