CCSI-ABEND.
    IF  WS-ABEND-REQUEST IS EQUAL TO SPACES
        MOVE SPACES             TO WS-ABEND-REQ-LIT.
    IF  WS-ABEND-STATUS IS EQUAL TO SPACES
        MOVE SPACES             TO WS-ABEND-STA-LIT.
    IF  WS-ABEND-LOCATION IS EQUAL TO SPACES
        MOVE SPACES             TO WS-ABEND-LOC-LIT.
    PERFORM CCSI-ABEND-ASTER    THRU CCSI-ABEND-ASTER-EXIT
                                5 TIMES.
    DISPLAY WS-ABEND-MSG UPON CONSOLE.
    DISPLAY WS-ABEND-MSG.
    PERFORM CCSI-ABEND-ASTER    THRU CCSI-ABEND-ASTER-EXIT
                                5 TIMES.
    MOVE SPACES                 TO WS-ABEND-SP-X.
    ADD WS-ABEND-SP             TO WS-ABEND9.
CCSI-ABEND-ASTER.
    DISPLAY WS-ABEND-STARS UPON CONSOLE.
    DISPLAY WS-ABEND-STARS.
CCSI-ABEND-ASTER-EXIT.
    EXIT.
CCSI-ABEND-EXIT.
    EXIT.
