CCSI-GREG-TO-JUL.
    IF  WS-DTE-DATE IS EQUAL TO ZERO
        MOVE ZERO               TO WS-DTE-JULIAN                 
        GO TO CCSI-GTJ-EXIT.
    IF  WS-DTE-MON IS EQUAL TO ZERO
        MOVE WS-DTE-ZMON        TO WS-DTE-MON
        MOVE WS-DTE-ZDAY        TO WS-DTE-DAY
        IF  WS-DTE-ZYEAR IS LESS THAN 50
            MOVE 20             TO WS-DTE-ZDAY                   
        ELSE
            MOVE 19             TO WS-DTE-ZDAY.                  
    IF  WS-DATE-FORMAT IS EQUAL TO 1                             
        MOVE WS-DTE-MON TO WS-DATE-FORMAT-SAVE                   
        MOVE WS-DTE-DAY TO WS-DTE-MON                            
        MOVE WS-DATE-FORMAT-SAVE TO WS-DTE-DAY.                  
    MOVE WS-DTE-YEAR            TO WS-DTE-JULYR.
    SET X-WS-DTE-DOM            TO WS-DTE-MON.
    MOVE WS-DTE-DDM (X-WS-DTE-DOM) TO WS-DTE-JULDAYS.
    ADD WS-DTE-DAY              TO WS-DTE-JULDAYS.
    COMPUTE WS-DTE-WORK         =  WS-DTE-YEAR * 250.            
    IF  WS-DTE-RMDR IS GREATER THAN ZERO OR                      
        WS-DTE-SPECIAL-LEAP-YEAR-SKIP                            
        NEXT SENTENCE                                            
    ELSE                                                         
        IF  WS-DTE-MON IS GREATER THAN 2                         
            ADD 1               TO WS-DTE-JULDAYS.               
    IF  WS-DATE-FORMAT IS EQUAL TO 1                             
        MOVE WS-DTE-MON TO WS-DATE-FORMAT-SAVE                   
        MOVE WS-DTE-DAY TO WS-DTE-MON                            
        MOVE WS-DATE-FORMAT-SAVE TO WS-DTE-DAY.                  
CCSI-GTJ-EXIT.
    EXIT.
