CCSI-ELAPSED-DAYS.
    MOVE WS-DTE-DATE-1          TO WS-DTE-JULIAN.
    IF  WS-DTE-DOW IS EQUAL TO ZERO
        GO TO CCSI-ED-30COMP.
    SUBTRACT WS-DTE-DATE-2      FROM WS-DTE-DATE-1 GIVING
      WS-DTE-RESULT.
    IF  WS-DTE-RESULT IS LESS THAN 370 AND                       
        WS-DTE-RESULT IS GREATER THAN -370                       
        GO TO CCSI-ED-INSURE-POSITIVE.                           
CCSI-ED-ACTUAL.
    COMPUTE WS-DTE-WORK = WS-DTE-JULYR * 365 + WS-DTE-JULDAYS.
    COMPUTE WS-DTE-LEAP = WS-DTE-JULYR * 250 + 750.
    ADD WS-DTE-LEAP-X           TO WS-DTE-WORK.
CCSI-ED-ACTUAL-EXIT.
    EXIT.
CCSI-ED-ACTUAL-MOVE.
    MOVE WS-DTE-WORK            TO WS-DTE-RESULT.
    MOVE WS-DTE-DATE-2          TO WS-DTE-JULIAN.
    PERFORM CCSI-ED-ACTUAL THRU CCSI-ED-ACTUAL-EXIT.
    GO TO CCSI-ED-SUBTRACT.
CCSI-ED-30COMP.
    PERFORM CCSI-JUL-TO-GREG  THRU  CCSI-JTG-EXIT.
    IF  WS-DATE-FORMAT IS EQUAL TO 1                             
        MOVE WS-DTE-MON         TO WS-DATE-FORMAT-SAVE           
        MOVE WS-DTE-DAY         TO WS-DTE-MON                    
        MOVE WS-DATE-FORMAT-SAVE TO WS-DTE-DAY.                  
    COMPUTE WS-DTE-WORK         =  WS-DTE-JULYR * 250.           
    IF  WS-DTE-RMDR IS GREATER THAN ZERO OR                      
        WS-DTE-SPECIAL-LEAP-YEAR-SKIP                            
        MOVE 27                 TO WS-DTE-DAY-OF-MON             
    ELSE
        MOVE 28                 TO WS-DTE-DAY-OF-MON.            
    IF  WS-DTE-MON IS EQUAL TO 2 AND
        WS-DTE-DAY IS GREATER THAN WS-DTE-DAY-OF-MON
        MOVE 30                 TO WS-DTE-DAY.
    COMPUTE WS-DTE-WORK = ((WS-DTE-YEAR * 12) + WS-DTE-MON)      
                           * 30 + WS-DTE-DAY.
CCSI-ED-30COMP-EXIT.
    EXIT.
CCSI-ED-30MOVE.
    MOVE WS-DTE-WORK            TO WS-DTE-RESULT.
    MOVE WS-DTE-DATE-2          TO WS-DTE-JULIAN.
    PERFORM CCSI-ED-30COMP THRU CCSI-ED-30COMP-EXIT.             
CCSI-ED-SUBTRACT.
    SUBTRACT WS-DTE-WORK        FROM WS-DTE-RESULT.
CCSI-ED-INSURE-POSITIVE.                                         
    IF  WS-DTE-RESULT IS LESS THAN ZERO                          
        COMPUTE WS-DTE-RESULT   =  WS-DTE-RESULT * -1.           
CCSI-ED-EXIT.
    EXIT.
