    REWRITE CARDHOLDER-MASTER  FROM CARDHOLDER-MASTER-RECORD.    
    IF WS-CPCRD-STATUS IS EQUAL TO 23                            
      MOVE 4 TO WS-IO-COMPLETE-SW                                
    ELSE                                                         
    IF WS-CPCRD-STATUS IS EQUAL TO ZERO                          
    MOVE 1 TO WS-IO-COMPLETE-SW                                  
    ELSE                                                         
    MOVE WS-CPCRD-STATUS TO WS-ABEND-STATUS                      
    MOVE 5 TO WS-IO-COMPLETE-SW.                                 
