CPD110BT-BTCH-ENH.                                               
    IF (( CM-CORP-ACCT-NMBR IS EQUAL TO LOW-VALUE ) OR           
        ( CM-CORP-ACCT-NMBR IS EQUAL TO ZEROS ) OR               
        ( CM-CORP-ACCT-NMBR IS EQUAL TO SPACE )) AND             
         CM-BLOCK-CODE   IS EQUAL TO 'M'    AND                  
         CM-DTE-BLOCK-CODE IS EQUAL TO OC-TODAYS-JULIAN          
         MOVE SPACES                TO BLK-CODE-OUT-REC          
         MOVE '1'                   TO BLK-REC-TYPE              
         MOVE CM-CUSTOMER-NUMBER    TO BLK-CUST-KEY              
         MOVE CM-KEY                TO BLK-ACCT-KEY              
         MOVE CM-BLOCK-CODE         TO BLK-BLOCK-CODE            
         WRITE BLK-CODE-OUT-REC                                  
         IF   WS-BLKFIL-STATUS IS EQUAL TO ZERO                  
              GO TO CPD110BT-EXIT                                
         ELSE                                                    
              MOVE 11502 TO WS-ABEND-CODE                        
              MOVE 'INVALID BLKFIL WRITE' TO WS-ABENDMSG         
              MOVE WS-BLKFIL-STATUS       TO WS-ABEND-STATUS     
              PERFORM CCSI-ABEND          THRU  CCSI-ABEND-EXIT. 
    IF (( CM-CORP-ACCT-NMBR IS NOT EQUAL TO LOW-VALUE ) AND      
        ( CM-CORP-ACCT-NMBR IS NOT EQUAL TO ZEROS ) AND          
        ( CM-CORP-ACCT-NMBR IS NOT EQUAL TO SPACE ))             
    AND  CM-ORG-NMBR       IS NOT EQUAL TO ZERO                  
    AND  CM-ORG-NMBR       IS NOT EQUAL TO 999                   
    AND  (    CM-BLOCK-CODE     IS EQUAL TO 'I'                  
          OR  CM-BLOCK-CODE     IS EQUAL TO 'M')                 
         MOVE SPACES                TO BLK-CODE-OUT-REC          
         MOVE '2'                   TO BLK-REC-TYPE              
         MOVE CM-CORP-ACCT-NUMBER   TO BLK-CUST-KEY              
         MOVE CM-BLOCK-CODE         TO BLK-BLOCK-CODE            
         MOVE CM-ACCT-LEDGER-STATUS TO BLK-ACCT-LEDGER-STATUS    
         WRITE BLK-CODE-OUT-REC                                  
         IF   WS-BLKFIL-STATUS IS EQUAL TO ZERO                  
              NEXT SENTENCE                                      
         ELSE                                                    
              MOVE 11503 TO WS-ABEND-CODE                        
              MOVE 'INVALID BLKFIL WRITE' TO WS-ABENDMSG         
              MOVE WS-BLKFIL-STATUS       TO WS-ABEND-STATUS     
              PERFORM CCSI-ABEND          THRU  CCSI-ABEND-EXIT  
         END-IF                                                  
    END-IF.                                                      
                                                                 
    IF (( CM-CORP-ACCT-NMBR IS NOT EQUAL TO LOW-VALUE ) AND      
        ( CM-CORP-ACCT-NMBR IS NOT EQUAL TO ZEROS ) AND          
        ( CM-CORP-ACCT-NMBR IS NOT EQUAL TO SPACE ))             
    AND  CM-ORG-NMBR       IS NOT EQUAL TO ZERO                  
    AND  CM-ORG-NMBR       IS NOT EQUAL TO 999                   
         MOVE SPACES                TO CORPKEYS-RECORD           
         MOVE CM-CORP-ACCT-NUMBER   TO CORPKEYS-CORP-CUST-KEY    
         MOVE CM-CUSTOMER-NUMBER    TO CORPKEYS-DEPT-CUST-KEY    
         MOVE CM-KEY                TO CORPKEYS-CM-KEY           
         WRITE CORPKEYS-RECORD                                   
         IF   WS-CORPKEYS-STATUS IS EQUAL TO ZERO                
              NEXT SENTENCE                                      
         ELSE                                                    
              MOVE 11504                    TO WS-ABEND-CODE     
              MOVE 'INVALID CORPKEYS WRITE' TO WS-ABENDMSG       
              MOVE WS-CORPKEYS-STATUS       TO WS-ABEND-STATUS   
              PERFORM CCSI-ABEND         THRU  CCSI-ABEND-EXIT   
         END-IF                                                  
    END-IF.                                                      
CPD110BT-EXIT.                                                   
    EXIT.                                                        
