                            RECORD CONTAINS 910 CHARACTERS       
                            BLOCK CONTAINS 0 RECORDS             
                            RECORDING MODE IS F                  
                            LABEL RECORDS ARE STANDARD.          
01  INTERCHANGE-REJECTED-TRANS                                   
                            PICTURE X(910).                      
01  INTERCHANGE-REJECT      PICTURE X(910).                      
01  IR-HEADER-RECORD.                                            
    03  IR-TXN-TYPE         PIC S999        COMP-3.              
    03  IR-ACCT-NMBR.                                            
        05  IR-AN-ORG       PICTURE S999        COMPUTATIONAL-3. 
            88  IR-HEADER                       VALUE +000.      
            88  IR-TRAILER                      VALUE +999.      
        05  IR-AN-TYPE      PICTURE S999        COMPUTATIONAL-3. 
        05  IR-AN-ACCT      PICTURE S9(16)      COMPUTATIONAL-3. 
    03  IR-CARD-NMBR.                                            
        05  IR-AN-CARD-ORG  PICTURE S999        COMPUTATIONAL-3. 
        05  IR-AN-CARD-TYP  PICTURE S999        COMPUTATIONAL-3. 
        05  IR-AN-CARD-NBR  PICTURE S9(16)      COMPUTATIONAL-3. 
    03  IR-PROC-DTE         PICTURE S9(7)       COMPUTATIONAL-3. 
    03  IR-TIME-STAMP       PICTURE S9(10)      COMPUTATIONAL-3. 
    03  IR-ALREADY-PROC     PICTURE X           VALUE SPACE.     
    03  FILLER              PICTURE X(871).                      
