DUAL-CURR-ORG-CURR.                                              
    MOVE WS-DC-CARD         TO WS-SAVE-ACCT.                     
    MOVE WS-DC-CARD         TO WS-CARDHLD-NBR.                   
    MOVE WS-DC-CARD         TO WS-DC-CARD-X.                     
    MOVE 16 TO WS-CARDHLD-LENGTH.                                
    MOVE 1  TO WS-TXN-SOURCE.                                    
    MOVE 'R'   TO WS-PROC-FLAG.                                  
    PERFORM  BAT-GET-ORG-TYPE  THRU  GOT-EXIT.                   
    IF WS-TXN-IND NOT = 9 AND                                    
       WS-ON-US-TYPE NOT = 0                                     
            MOVE  WS-GBIN-DUAL-CURR-FLAG                         
                                 TO WS-PREFIX-FLAG               
            MOVE  WS-GOT-ORG     TO WS-DC-ORG                    
            MOVE  WS-PROC-PCURR  TO WS-DC-CURR                   
            MOVE  WS-PROC-SORG   TO WS-DC-SORG                   
            MOVE  WS-PROC-SCURR  TO WS-DC-SCURR                  
            GO TO DCOC-EXIT                                      
    END-IF                                                       
        GO TO DCOC-EXIT.                                         
DCOC-EXIT.                                                       
    EXIT.                                                        
DUAL-CURR-PREFIX-POS.                                            
    IF  WS-DIGIT > 10                                            
        GO TO DCPP-EXIT.                                         
    IF  WS-DC-PREFIX-POS(WS-DIGIT) IS NOT EQUAL ZEROES           
        COMPUTE WS-DC-POS = 11 - WS-DIGIT                        
        IF  WS-DC-POS IS EQUAL 10                                
            IF  WS-DC-CARD-P10 IS EQUAL                          
                   WS-DUAL-CURR-PREFIX(X-DUAL-CURR)              
                MOVE 'Y'             TO WS-PREFIX-FLAG           
                GO TO DCPP-EXIT                                  
            END-IF                                               
        ELSE                                                     
        IF  WS-DC-POS IS EQUAL 9                                 
            IF  WS-DC-CARD-P09 IS EQUAL                          
                   WS-DUAL-CURR-PREFIX(X-DUAL-CURR)              
                MOVE 'Y'             TO WS-PREFIX-FLAG           
                GO TO DCPP-EXIT                                  
            END-IF                                               
        ELSE                                                     
        IF  WS-DC-POS IS EQUAL 8                                 
            IF  WS-DC-CARD-P08 IS EQUAL                          
                   WS-DUAL-CURR-PREFIX(X-DUAL-CURR)              
                MOVE 'Y'             TO WS-PREFIX-FLAG           
                GO TO DCPP-EXIT                                  
            END-IF                                               
        ELSE                                                     
        IF  WS-DC-POS IS EQUAL 7                                 
            IF  WS-DC-CARD-P07 IS EQUAL                          
                   WS-DUAL-CURR-PREFIX(X-DUAL-CURR)              
                MOVE 'Y'             TO WS-PREFIX-FLAG           
                GO TO DCPP-EXIT                                  
            END-IF                                               
        ELSE                                                     
        IF  WS-DC-POS IS EQUAL 6                                 
            IF  WS-DC-CARD-P06 IS EQUAL                          
                   WS-DUAL-CURR-PREFIX(X-DUAL-CURR)              
                MOVE 'Y'             TO WS-PREFIX-FLAG           
                GO TO DCPP-EXIT                                  
            END-IF                                               
        ELSE                                                     
        IF  WS-DC-POS IS EQUAL 5                                 
            IF  WS-DC-CARD-P05 IS EQUAL                          
                   WS-DUAL-CURR-PREFIX(X-DUAL-CURR)              
                MOVE 'Y'             TO WS-PREFIX-FLAG           
                GO TO DCPP-EXIT                                  
            END-IF                                               
        ELSE                                                     
        IF  WS-DC-POS IS EQUAL 4                                 
            IF  WS-DC-CARD-P04 IS EQUAL                          
                   WS-DUAL-CURR-PREFIX(X-DUAL-CURR)              
                MOVE 'Y'             TO WS-PREFIX-FLAG           
                GO TO DCPP-EXIT                                  
            END-IF                                               
        ELSE                                                     
        IF  WS-DC-POS IS EQUAL 3                                 
            IF  WS-DC-CARD-P03 IS EQUAL                          
                   WS-DUAL-CURR-PREFIX(X-DUAL-CURR)              
                MOVE 'Y'             TO WS-PREFIX-FLAG           
                GO TO DCPP-EXIT                                  
            END-IF                                               
        ELSE                                                     
        IF  WS-DC-POS IS EQUAL 2                                 
            IF  WS-DC-CARD-P02 IS EQUAL                          
                   WS-DUAL-CURR-PREFIX(X-DUAL-CURR)              
                MOVE 'Y'             TO WS-PREFIX-FLAG           
                GO TO DCPP-EXIT                                  
            END-IF                                               
        ELSE                                                     
        IF  WS-DC-POS IS EQUAL 1                                 
            IF  WS-DC-CARD-P01 IS EQUAL                          
                   WS-DUAL-CURR-PREFIX(X-DUAL-CURR)              
                MOVE 'Y'             TO WS-PREFIX-FLAG           
                GO TO DCPP-EXIT                                  
            END-IF                                               
        END-IF                                                   
        GO TO DCPP-EXIT.                                         
    ADD 1                            TO WS-DIGIT.                
    GO TO DUAL-CURR-PREFIX-POS.                                  
DCPP-EXIT.                                                       
    EXIT.                                                        
DUAL-CURR-SORG-SCURR.                                            
    IF  X-DUAL-CURR IS GREATER THAN WS-DUAL-CURR-LOOP            
        MOVE 'N'          TO  WS-PREFIX-FLAG                     
        GO TO DCSS-EXIT.                                         
    IF  WS-DC-ORG IS EQUAL WS-DUAL-CURR-SORG(X-DUAL-CURR)        
       MOVE WS-DUAL-CURR-PREFIX(X-DUAL-CURR) TO WS-DC-PREFIX     
       MOVE WS-DC-CARD              TO WS-DC-CARD-NBR            
       MOVE 1                       TO WS-DIGIT                  
       PERFORM DUAL-CURR-PREFIX-POS THRU DCPP-EXIT               
       IF  WS-PREFIX-FLAG = 'Y'                                  
          MOVE WS-DUAL-CURR-PORG(X-DUAL-CURR)    TO WS-DC-ORG    
          MOVE WS-DUAL-CURR-PCURR(X-DUAL-CURR)   TO WS-DC-CURR   
          MOVE WS-DUAL-CURR-SORG(X-DUAL-CURR)    TO WS-DC-SORG   
          MOVE WS-DUAL-CURR-SCURR(X-DUAL-CURR)   TO WS-DC-SCURR  
          GO TO DCSS-EXIT.                                       
    SET X-DUAL-CURR UP BY 1.                                     
    GO TO DUAL-CURR-SORG-SCURR.                                  
DCSS-EXIT.                                                       
    EXIT.                                                        
