CPS559-FUTURE-STATEMENT-DATE.
    MOVE  0                     TO CPS359-F-STMT-TODAY-RESULT
                                   CPS359-F-ERROR-RESULT
                                   CPS359-F-STMT-DTE-RESULT
                                   CPS359-F-STMT-PROC-DTE-RESULT
                                   CPS359-F-ACCR-FROM-DTE-RESULT
                                   CPS359-F-ACCR-THRU-DTE-RESULT
                                   CPS359-F-TODAY-ACCR-FROM-DTE
                                   CPS359-F-TODAY-PROC-DTE
                                   CPS359-F-TODAY-ACCR-THRU-DTE
                                   CPS359-F-CALC-ACCR-FROM-DTE
                                   CPS359-F-CALC-PROC-DTE
                                   CPS359-F-CALC-STMT-DTE
                                   CPS359-F-CALC-ACCR-THRU-DTE.
    MOVE WS-DATE-FORMAT         TO CPS359-F-DATE-FORMAT-SAVE.
    MOVE ZERO                   TO WS-DATE-FORMAT.
    IF  CPS359-F-STMT-NBR-INPUT IS NOT EQUAL TO 1  AND
        CPS359-F-STMT-NBR-INPUT IS NOT EQUAL TO 2  AND
        CPS359-F-STMT-NBR-INPUT IS NOT EQUAL TO 3  AND
        CPS359-F-STMT-NBR-INPUT IS NOT EQUAL TO 4
        MOVE 1                  TO CPS359-F-ERROR-RESULT
        GO TO CPS559-FSD-WRAP-UP-RTN.
    IF  CPS359-F-PGM-LOCATION-INPUT IS NOT EQUAL TO 'D' AND
        CPS359-F-PGM-LOCATION-INPUT IS NOT EQUAL TO 'X'
        MOVE 1                  TO CPS359-F-ERROR-RESULT
        GO TO CPS559-FSD-WRAP-UP-RTN.
    IF  (CM-CYCLE IS LESS THAN 1) OR
        (CM-CYCLE IS GREATER THAN 31)
        MOVE 2                  TO CPS359-F-ERROR-RESULT
        GO TO CPS559-FSD-WRAP-UP-RTN.
    IF  CPS359-F-PGM-LOCATION-INPUT IS EQUAL TO 'D'
        MOVE OC-DTE-LST-ACCR    TO WS-DTE-JULIAN
        MOVE 1                  TO WS-DTE-FREQ
        MOVE 'D'                TO WS-DTE-PERIOD
        PERFORM CCSI-FUTURE-DATE THRU CCSI-FD-EXIT
        MOVE WS-DTE-JULIAN      TO CPS359-F-TODAY-ACCR-FROM-DTE
        MOVE OC-TODAYS-JULIAN   TO CPS359-F-TODAY-PROC-DTE
        MOVE OC-ACCR-THRU-DTE   TO CPS359-F-TODAY-ACCR-THRU-DTE
        GO TO CPS559-FSD-DETRMINE-STMT-FREQ.
    MOVE OC-ACCR-THRU-DTE       TO WS-DTE-JULIAN.
    MOVE 1                      TO WS-DTE-FREQ.
    MOVE 'D'                    TO WS-DTE-PERIOD.
    PERFORM CCSI-FUTURE-DATE THRU CCSI-FD-EXIT.
    MOVE WS-DTE-JULIAN          TO CPS359-F-TODAY-ACCR-FROM-DTE.
    MOVE OC-DTE-NXT-PROC        TO CPS359-F-TODAY-PROC-DTE.
    MOVE OC-DTE-NXT-PROC        TO CPS359-F-TODAY-ACCR-THRU-DTE.
CPS559-FSD-CALC-TD-LOOP.
    MOVE CPS359-F-TODAY-ACCR-THRU-DTE
                                TO WS-DTE-JULIAN.
    PERFORM CCSI-JUL-TO-GREG THRU CCSI-JTG-EXIT.
    SET X-WS-DTE-DOM            TO WS-DTE-MM.
    SET X-WS-DTE-DOM UP BY 1.
    COMPUTE WS-DTE-WORK         =  WS-DTE-YEAR * 250.
    IF  (WS-DTE-RMDR IS GREATER THAN ZERO) OR
        (WS-DTE-SPECIAL-LEAP-YEAR-SKIP)
        MOVE WS-DTE-TABLE-REGULAR-YEAR
                                TO WS-DTE-TABLE
    ELSE
        MOVE WS-DTE-TABLE-LEAP-YEAR
                                TO WS-DTE-TABLE.
    IF  WS-DTE-DDM (X-WS-DTE-DOM) IS EQUAL TO WS-DTE-JULDAYS
        MOVE WS-DTE-TABLE-REGULAR-YEAR
                                TO WS-DTE-TABLE
        GO TO CPS559-FSD-DETRMINE-STMT-FREQ.
    MOVE WS-DTE-TABLE-REGULAR-YEAR
                                TO WS-DTE-TABLE.
    MOVE CPS359-F-TODAY-ACCR-THRU-DTE
                                TO WS-DTE-JULIAN.
    MOVE 1                      TO WS-DTE-FREQ.
    MOVE 'D'                    TO WS-DTE-PERIOD.
    PERFORM CCSI-FUTURE-DATE THRU CCSI-FD-EXIT.
    MOVE WS-DTE-JULIAN          TO CPS359-F-TODAY-ACCR-THRU-DTE.
    PERFORM CCSI-DAY-OF-WEEK THRU CCSI-DOW-EXIT.
    IF  (WS-DTE-DOW IS EQUAL TO 0) AND
        (OC-WORK-WEEK-R (1) IS EQUAL TO 'C')
        GO TO CPS559-FSD-CALC-TD-LOOP.
    IF  (WS-DTE-DOW IS EQUAL TO 1) AND
        (OC-WORK-WEEK-R (2) IS EQUAL TO 'C')
        GO TO CPS559-FSD-CALC-TD-LOOP.
    IF  (WS-DTE-DOW IS EQUAL TO 2) AND
        (OC-WORK-WEEK-R (3) IS EQUAL TO 'C')
        GO TO CPS559-FSD-CALC-TD-LOOP.
    IF  (WS-DTE-DOW IS EQUAL TO 3) AND
        (OC-WORK-WEEK-R (4) IS EQUAL TO 'C')
        GO TO CPS559-FSD-CALC-TD-LOOP.
    IF  (WS-DTE-DOW IS EQUAL TO 4) AND
        (OC-WORK-WEEK-R (5) IS EQUAL TO 'C')
        GO TO CPS559-FSD-CALC-TD-LOOP.
    IF  (WS-DTE-DOW IS EQUAL TO 5) AND
        (OC-WORK-WEEK-R (6) IS EQUAL TO 'C')
        GO TO CPS559-FSD-CALC-TD-LOOP.
    IF  (WS-DTE-DOW IS EQUAL TO 6) AND
        (OC-WORK-WEEK-R (7) IS EQUAL TO 'C')
        GO TO CPS559-FSD-CALC-TD-LOOP.
    MOVE 0                      TO CPS359-F-HOLIDAY-SW.
    MOVE CPS359-F-TODAY-ACCR-THRU-DTE
                                TO WS-DTE-JULIAN.
    PERFORM CCSI-JUL-TO-GREG THRU CCSI-JTG-EXIT.
    PERFORM CPS559-FSD-ORG-HOLIDAY-CHECK THRU CPS559-FSD-OHC-EXIT
        VARYING CPS359-F-HOLIDAY-SUB FROM 1 BY 1
            UNTIL (CPS359-F-HOLIDAY-SW  IS EQUAL TO 1) OR
                  (CPS359-F-HOLIDAY-SUB IS GREATER THAN 16).
    IF  CPS359-F-HOLIDAY-SW IS EQUAL TO 1
        GO TO CPS559-FSD-CALC-TD-LOOP.
    MOVE CPS359-F-TODAY-ACCR-THRU-DTE
                                TO WS-DTE-JULIAN.
    MOVE 1                      TO WS-DTE-FREQ.
    MOVE 'D'                    TO WS-DTE-PERIOD.
    PERFORM CCSI-BACKUP-DATE THRU CCSI-BD-EXIT.
    MOVE WS-DTE-JULIAN          TO CPS359-F-TODAY-ACCR-THRU-DTE.
CPS559-FSD-DETRMINE-STMT-FREQ.
    IF  CM-STMT-FREQ IS EQUAL TO 0
        PERFORM CPS559-FSD-MONTHLY-CYCLE THRU
                CPS559-FSD-MC-EXIT
    ELSE
        PERFORM CPS559-FSD-NON-MONTHLY-CYCLE THRU
                CPS559-FSD-NMC-EXIT.
CPS559-FSD-WRAP-UP-RTN.
    MOVE CPS359-F-CALC-ACCR-FROM-DTE
                                TO CPS359-F-ACCR-FROM-DTE-RESULT.
    MOVE CPS359-F-CALC-PROC-DTE TO CPS359-F-STMT-PROC-DTE-RESULT.
    MOVE CPS359-F-CALC-STMT-DTE TO CPS359-F-STMT-DTE-RESULT.
    MOVE CPS359-F-CALC-STMT-DTE TO CPS359-F-ACCR-THRU-DTE-RESULT.
    MOVE CPS359-F-DATE-FORMAT-SAVE
                                TO WS-DATE-FORMAT.
CPS559-FSD-EXIT.
    EXIT.
CPS559-FSD-MONTHLY-CYCLE.
    MOVE CPS359-F-TODAY-ACCR-THRU-DTE
                                TO CPS359-F-CALC-STMT-DTE
                                   WS-DTE-JULIAN.
    PERFORM CCSI-JUL-TO-GREG THRU CCSI-JTG-EXIT.
    PERFORM CPS559-FSD-VLD-STMT-DTE-LOOP THRU
            CPS559-FSD-VSDL-EXIT.
    IF  CPS359-F-CALC-STMT-DTE IS LESS THAN
        CPS359-F-TODAY-ACCR-FROM-DTE
        MOVE 'P'                TO CPS359-F-WORK-SW
        GO TO CPS559-FSD-MC-BUMP-STMT-DTE.
    IF CPS359-F-CALC-STMT-DTE IS GREATER THAN
       CPS359-F-TODAY-ACCR-THRU-DTE
       MOVE 'A'                 TO CPS359-F-WORK-SW
       GO TO CPS559-FSD-MC-BUMP-STMT-DTE.
    MOVE 'T'                    TO CPS359-F-WORK-SW.
CPS559-FSD-MC-BUMP-STMT-DTE.
    MOVE CPS359-F-CALC-STMT-DTE TO WS-DTE-JULIAN.
    PERFORM CCSI-JUL-TO-GREG THRU CCSI-JTG-EXIT.
    IF  CPS359-F-WORK-SW IS EQUAL TO 'P'
        ADD CPS359-F-STMT-NBR-INPUT
                                TO WS-DTE-MM
        GO TO CPS559-FSD-MC-BSD-CONT.
    IF  CPS359-F-WORK-SW IS EQUAL TO 'A'
        COMPUTE WS-DTE-MM = WS-DTE-MM +
            (CPS359-F-STMT-NBR-INPUT - 1)
        GO TO CPS559-FSD-MC-BSD-CONT.
    IF  CPS359-F-STMT-NBR-INPUT IS EQUAL TO 1
        MOVE  1                 TO CPS359-F-STMT-TODAY-RESULT
        MOVE  CPS359-F-TODAY-ACCR-FROM-DTE
                                TO CPS359-F-CALC-ACCR-FROM-DTE
        MOVE  CPS359-F-TODAY-PROC-DTE
                                TO CPS359-F-CALC-PROC-DTE
        MOVE  CPS359-F-TODAY-ACCR-THRU-DTE
                                TO CPS359-F-CALC-STMT-DTE
        GO TO   CPS559-FSD-MC-EXIT.
    COMPUTE WS-DTE-MM = WS-DTE-MM +
        (CPS359-F-STMT-NBR-INPUT - 1).
CPS559-FSD-MC-BSD-CONT.
    IF  WS-DTE-MM IS GREATER THAN 12
        SUBTRACT 12 FROM WS-DTE-MM
        ADD  01     TO   WS-DTE-YY.
    PERFORM CPS559-FSD-VLD-STMT-DTE-LOOP THRU
            CPS559-FSD-VSDL-EXIT.
    MOVE CPS359-F-CALC-STMT-DTE TO CPS359-F-CALC-PROC-DTE.
    MOVE 0                      TO CPS359-F-BOM-PROC-SW.
    PERFORM CPS559-FSD-ADJST-PROC-DTE-RTN THRU
            CPS559-FSD-APDR-EXIT.
    MOVE CPS359-F-CALC-PROC-DTE TO CPS359-F-CALC-ACCR-FROM-DTE.
    PERFORM CPS559-FSD-A-ACRU-FRM-DTE-RTN THRU
            CPS559-FSD-AAFDR-EXIT.
    MOVE CPS359-F-CALC-PROC-DTE TO CPS359-F-CALC-STMT-DTE.
    PERFORM CPS559-FSD-ADJST-STMT-DTE-RTN THRU
            CPS559-FSD-ASDR-EXIT.
CPS559-FSD-MC-EXIT.
    EXIT.
CPS559-FSD-NON-MONTHLY-CYCLE.
    MOVE CM-DTE-NXT-STMT        TO WS-DTE-JULIAN.
    PERFORM CCSI-JUL-TO-GREG THRU CCSI-JTG-EXIT.
    PERFORM CCSI-DATE-VALIDATION THRU CCSI-DV-EXIT.
    IF  WS-DTE-DATE-IS-INVALID
        MOVE 2                  TO CPS359-F-ERROR-RESULT
        MOVE 0                  TO CPS359-F-CALC-ACCR-FROM-DTE
                                   CPS359-F-CALC-PROC-DTE
                                   CPS359-F-CALC-STMT-DTE
        GO TO CPS559-FSD-NMC-EXIT.
    IF  CM-DTE-NXT-STMT IS LESS THAN CPS359-F-TODAY-ACCR-FROM-DTE
        MOVE 2                  TO CPS359-F-ERROR-RESULT
        MOVE 0                  TO CPS359-F-CALC-ACCR-FROM-DTE
                                   CPS359-F-CALC-PROC-DTE
                                   CPS359-F-CALC-STMT-DTE
        GO TO CPS559-FSD-NMC-EXIT.
    MOVE CM-DTE-NXT-STMT        TO CPS359-F-CALC-PROC-DTE.
    MOVE 0                      TO CPS359-F-BOM-PROC-SW.
    PERFORM CPS559-FSD-ADJST-PROC-DTE-RTN THRU
            CPS559-FSD-APDR-EXIT.
    MOVE CPS359-F-CALC-PROC-DTE TO CPS359-F-CALC-ACCR-FROM-DTE.
    PERFORM CPS559-FSD-A-ACRU-FRM-DTE-RTN THRU
            CPS559-FSD-AAFDR-EXIT.
    MOVE CPS359-F-CALC-PROC-DTE TO CPS359-F-CALC-STMT-DTE.
    PERFORM CPS559-FSD-ADJST-STMT-DTE-RTN THRU
            CPS559-FSD-ASDR-EXIT.
    MOVE CPS359-F-CALC-STMT-DTE TO CPS359-F-CALC-ACCR-THRU-DTE
                                   WS-DTE-JULIAN.
    PERFORM CCSI-JUL-TO-GREG THRU CCSI-JTG-EXIT.
    PERFORM CPS559-FSD-VLD-STMT-DTE-LOOP THRU
            CPS559-FSD-VSDL-EXIT.
    IF  CPS359-F-CALC-STMT-DTE IS LESS THAN
        CPS359-F-CALC-ACCR-FROM-DTE
        MOVE 2                  TO CPS359-F-ERROR-RESULT
        MOVE 0                  TO CPS359-F-CALC-ACCR-FROM-DTE
                                   CPS359-F-CALC-PROC-DTE
                                   CPS359-F-CALC-STMT-DTE
        GO TO CPS559-FSD-NMC-EXIT.
    IF  CPS359-F-CALC-STMT-DTE IS GREATER THAN
        CPS359-F-CALC-ACCR-THRU-DTE
        MOVE 2                  TO CPS359-F-ERROR-RESULT
        MOVE 0                  TO CPS359-F-CALC-ACCR-FROM-DTE
                                   CPS359-F-CALC-PROC-DTE
                                   CPS359-F-CALC-STMT-DTE
        GO TO CPS559-FSD-NMC-EXIT.
    IF  ((CPS359-F-CALC-STMT-DTE IS GREATER THAN
         CPS359-F-TODAY-ACCR-FROM-DTE)  OR
        (CPS359-F-CALC-STMT-DTE IS EQUAL TO
         CPS359-F-TODAY-ACCR-FROM-DTE)) AND
        ((CPS359-F-CALC-STMT-DTE IS LESS THAN
         CPS359-F-TODAY-ACCR-THRU-DTE)  OR
        (CPS359-F-CALC-STMT-DTE IS EQUAL TO
         CPS359-F-TODAY-ACCR-THRU-DTE)) AND
        (CPS359-F-STMT-NBR-INPUT IS EQUAL TO 1)
        MOVE  1                 TO CPS359-F-STMT-TODAY-RESULT
        MOVE  CPS359-F-TODAY-ACCR-FROM-DTE
                                TO CPS359-F-CALC-ACCR-FROM-DTE
        MOVE  CPS359-F-TODAY-PROC-DTE
                                TO CPS359-F-CALC-PROC-DTE
        MOVE  CPS359-F-TODAY-ACCR-THRU-DTE
                                TO CPS359-F-CALC-STMT-DTE
        GO TO CPS559-FSD-NMC-EXIT.
    MOVE CPS359-F-CALC-STMT-DTE TO WS-DTE-JULIAN.
    PERFORM CCSI-JUL-TO-GREG THRU CCSI-JTG-EXIT.
    COMPUTE CPS359-F-WORK-FIELD = CPS359-F-STMT-NBR-INPUT - 1.
    PERFORM CPS559-FSD-NMC-BUMP-LOOP THRU
            CPS559-FSD-NMC-BL-EXIT
       CPS359-F-WORK-FIELD TIMES.
    GO TO CPS559-FSD-NMC-BUMP-CONT.
CPS559-FSD-NMC-BUMP-LOOP.
    ADD CM-STMT-FREQ            TO WS-DTE-MM.
    IF  WS-DTE-MM IS GREATER THAN 12
        SUBTRACT 12 FROM WS-DTE-MM
        ADD 01      TO   WS-DTE-YY.
CPS559-FSD-NMC-BL-EXIT.
CPS559-FSD-NMC-BUMP-CONT.
    PERFORM CPS559-FSD-VLD-STMT-DTE-LOOP THRU
            CPS559-FSD-VSDL-EXIT.
    MOVE CPS359-F-CALC-STMT-DTE TO CPS359-F-CALC-PROC-DTE.
    MOVE 0                      TO CPS359-F-BOM-PROC-SW.
    PERFORM CPS559-FSD-ADJST-PROC-DTE-RTN THRU
            CPS559-FSD-APDR-EXIT.
    MOVE CPS359-F-CALC-PROC-DTE TO CPS359-F-CALC-ACCR-FROM-DTE.
    PERFORM CPS559-FSD-A-ACRU-FRM-DTE-RTN THRU
            CPS559-FSD-AAFDR-EXIT.
    MOVE CPS359-F-CALC-PROC-DTE TO CPS359-F-CALC-STMT-DTE.
    PERFORM CPS559-FSD-ADJST-STMT-DTE-RTN THRU
            CPS559-FSD-ASDR-EXIT.
CPS559-FSD-NMC-EXIT.
    EXIT.
CPS559-FSD-ORG-HOLIDAY-CHECK.
    IF  OC-HOLIDAYS (CPS359-F-HOLIDAY-SUB) IS EQUAL TO
        WS-DTE-MMDD
        MOVE 1                  TO CPS359-F-HOLIDAY-SW.
CPS559-FSD-OHC-EXIT.
    EXIT.
CPS559-FSD-VLD-STMT-DTE-LOOP.
    MOVE CM-CYCLE               TO WS-DTE-DD.
    IF  WS-DTE-MM IS EQUAL TO 2 AND
        WS-DTE-DD IS GREATER THAN 29
        MOVE 29                 TO WS-DTE-DD.
    MOVE WS-DTE-MM              TO WS-DTE-MON.
    MOVE WS-DTE-DD              TO WS-DTE-DAY.
    MOVE WS-DTE-YY              TO WS-DTE-ZDAY.
    MOVE SPACES                 TO WS-DTE-ZYEAR-X.
CPS559-FSD-VSD-LOOP.
    PERFORM CCSI-DATE-VALIDATION THRU CCSI-DV-EXIT.
    IF  WS-DTE-DATE-IS-INVALID
        MOVE WS-DTE-MDY         TO WS-DTE-DATE
        PERFORM CCSI-GREG-TO-JUL THRU CCSI-GTJ-EXIT
        MOVE 1                  TO WS-DTE-FREQ
        MOVE 'D'                TO WS-DTE-PERIOD
        PERFORM CCSI-BACKUP-DATE THRU CCSI-BD-EXIT
        MOVE WS-DTE-JULIAN      TO CPS359-F-CALC-STMT-DTE
        PERFORM CCSI-JUL-TO-GREG THRU CCSI-JTG-EXIT
        GO TO CPS559-FSD-VSD-LOOP.
    MOVE WS-DTE-MDY             TO WS-DTE-DATE.
    PERFORM CCSI-GREG-TO-JUL THRU CCSI-GTJ-EXIT.
    MOVE WS-DTE-JULIAN          TO CPS359-F-CALC-STMT-DTE.
CPS559-FSD-VSDL-EXIT.
    EXIT.
CPS559-FSD-ADJST-PROC-DTE-RTN.
    MOVE CPS359-F-CALC-PROC-DTE TO WS-DTE-JULIAN.
    PERFORM CCSI-DAY-OF-WEEK THRU CCSI-DOW-EXIT.
    IF  (WS-DTE-DOW IS EQUAL TO 0) AND
        (OC-WORK-WEEK-R (1) IS EQUAL TO 'C')
        GO TO CPS559-FSD-APDR-CONT.
    IF  (WS-DTE-DOW IS EQUAL TO 1) AND
        (OC-WORK-WEEK-R (2) IS EQUAL TO 'C')
        GO TO CPS559-FSD-APDR-CONT.
    IF  (WS-DTE-DOW IS EQUAL TO 2) AND
        (OC-WORK-WEEK-R (3) IS EQUAL TO 'C')
        GO TO CPS559-FSD-APDR-CONT.
    IF  (WS-DTE-DOW IS EQUAL TO 3) AND
        (OC-WORK-WEEK-R (4) IS EQUAL TO 'C')
        GO TO CPS559-FSD-APDR-CONT.
    IF  (WS-DTE-DOW IS EQUAL TO 4) AND
        (OC-WORK-WEEK-R (5) IS EQUAL TO 'C')
        GO TO CPS559-FSD-APDR-CONT.
    IF  (WS-DTE-DOW IS EQUAL TO 5) AND
        (OC-WORK-WEEK-R (6) IS EQUAL TO 'C')
        GO TO CPS559-FSD-APDR-CONT.
    IF  (WS-DTE-DOW IS EQUAL TO 6) AND
        (OC-WORK-WEEK-R (7) IS EQUAL TO 'C')
        GO TO CPS559-FSD-APDR-CONT.
    MOVE 0                      TO CPS359-F-HOLIDAY-SW.
    MOVE CPS359-F-CALC-PROC-DTE TO WS-DTE-JULIAN.
    PERFORM CCSI-JUL-TO-GREG THRU CCSI-JTG-EXIT.
    PERFORM CPS559-FSD-ORG-HOLIDAY-CHECK THRU CPS559-FSD-OHC-EXIT
        VARYING CPS359-F-HOLIDAY-SUB FROM 1 BY 1
            UNTIL (CPS359-F-HOLIDAY-SW  IS EQUAL TO 1) OR
                  (CPS359-F-HOLIDAY-SUB IS GREATER THAN 16).
    IF  CPS359-F-HOLIDAY-SW IS EQUAL TO 0
        GO TO CPS559-FSD-APDR-EXIT.
CPS559-FSD-APDR-CONT.
    MOVE CPS359-F-CALC-PROC-DTE TO WS-DTE-JULIAN.
    PERFORM CCSI-JUL-TO-GREG THRU CCSI-JTG-EXIT.
    IF  (WS-DTE-DD IS EQUAL TO 1) OR
        (CPS359-F-BOM-PROC-SW IS EQUAL TO 1)
        MOVE CPS359-F-CALC-PROC-DTE
                                TO WS-DTE-JULIAN
        MOVE 1                  TO WS-DTE-FREQ
        MOVE 'D'                TO WS-DTE-PERIOD
        PERFORM CCSI-FUTURE-DATE THRU CCSI-FD-EXIT
        MOVE WS-DTE-JULIAN      TO CPS359-F-CALC-PROC-DTE
        MOVE 1                  TO CPS359-F-BOM-PROC-SW
        GO TO CPS559-FSD-ADJST-PROC-DTE-RTN
    ELSE
        MOVE CPS359-F-CALC-PROC-DTE
                                TO WS-DTE-JULIAN
        MOVE 1                  TO WS-DTE-FREQ
        MOVE 'D'                TO WS-DTE-PERIOD
        PERFORM CCSI-BACKUP-DATE THRU CCSI-BD-EXIT
        MOVE WS-DTE-JULIAN      TO CPS359-F-CALC-PROC-DTE
        GO TO CPS559-FSD-ADJST-PROC-DTE-RTN.
CPS559-FSD-APDR-EXIT.
    EXIT.
CPS559-FSD-A-ACRU-FRM-DTE-RTN.
    MOVE CPS359-F-CALC-ACCR-FROM-DTE
                                TO WS-DTE-JULIAN.
    PERFORM CCSI-JUL-TO-GREG THRU CCSI-JTG-EXIT.
    IF  WS-DTE-DD IS EQUAL TO 1
        GO TO CPS559-FSD-AAFDR-EXIT.
    MOVE CPS359-F-CALC-ACCR-FROM-DTE
                                TO WS-DTE-JULIAN
    MOVE 1                      TO WS-DTE-FREQ
    MOVE 'D'                    TO WS-DTE-PERIOD
    PERFORM CCSI-BACKUP-DATE THRU CCSI-BD-EXIT
    MOVE WS-DTE-JULIAN          TO CPS359-F-CALC-ACCR-FROM-DTE.
    PERFORM CCSI-DAY-OF-WEEK THRU CCSI-DOW-EXIT.
    IF  (WS-DTE-DOW IS EQUAL TO 0) AND
        (OC-WORK-WEEK-R (1) IS EQUAL TO 'C')
        GO TO CPS559-FSD-A-ACRU-FRM-DTE-RTN.
    IF  (WS-DTE-DOW IS EQUAL TO 1) AND
        (OC-WORK-WEEK-R (2) IS EQUAL TO 'C')
        GO TO CPS559-FSD-A-ACRU-FRM-DTE-RTN.
    IF  (WS-DTE-DOW IS EQUAL TO 2) AND
        (OC-WORK-WEEK-R (3) IS EQUAL TO 'C')
        GO TO CPS559-FSD-A-ACRU-FRM-DTE-RTN.
    IF  (WS-DTE-DOW IS EQUAL TO 3) AND
        (OC-WORK-WEEK-R (4) IS EQUAL TO 'C')
        GO TO CPS559-FSD-A-ACRU-FRM-DTE-RTN.
    IF  (WS-DTE-DOW IS EQUAL TO 4) AND
        (OC-WORK-WEEK-R (5) IS EQUAL TO 'C')
        GO TO CPS559-FSD-A-ACRU-FRM-DTE-RTN.
    IF  (WS-DTE-DOW IS EQUAL TO 5) AND
        (OC-WORK-WEEK-R (6) IS EQUAL TO 'C')
        GO TO CPS559-FSD-A-ACRU-FRM-DTE-RTN.
    IF  (WS-DTE-DOW IS EQUAL TO 6) AND
        (OC-WORK-WEEK-R (7) IS EQUAL TO 'C')
        GO TO CPS559-FSD-A-ACRU-FRM-DTE-RTN.
    MOVE 0                      TO CPS359-F-HOLIDAY-SW.
    MOVE CPS359-F-CALC-ACCR-FROM-DTE
                                TO WS-DTE-JULIAN.
    PERFORM CCSI-JUL-TO-GREG THRU CCSI-JTG-EXIT.
    PERFORM CPS559-FSD-ORG-HOLIDAY-CHECK THRU CPS559-FSD-OHC-EXIT
        VARYING CPS359-F-HOLIDAY-SUB FROM 1 BY 1
            UNTIL (CPS359-F-HOLIDAY-SW  IS EQUAL TO 1) OR
                  (CPS359-F-HOLIDAY-SUB IS GREATER THAN 16).
    IF  CPS359-F-HOLIDAY-SW IS EQUAL TO 1
        GO TO CPS559-FSD-A-ACRU-FRM-DTE-RTN.
    MOVE CPS359-F-CALC-PROC-DTE TO CPS359-F-CALC-ACCR-FROM-DTE.
CPS559-FSD-AAFDR-EXIT.
    EXIT.
CPS559-FSD-ADJST-STMT-DTE-RTN.
    MOVE CPS359-F-CALC-STMT-DTE TO WS-DTE-JULIAN.
    PERFORM CCSI-JUL-TO-GREG THRU CCSI-JTG-EXIT.
    SET X-WS-DTE-DOM            TO WS-DTE-MM.
    SET X-WS-DTE-DOM UP BY 1.
    COMPUTE WS-DTE-WORK         =  WS-DTE-YEAR * 250.
    IF  (WS-DTE-RMDR IS GREATER THAN ZERO) OR
        (WS-DTE-SPECIAL-LEAP-YEAR-SKIP)
        MOVE WS-DTE-TABLE-REGULAR-YEAR
                                TO WS-DTE-TABLE
    ELSE
        MOVE WS-DTE-TABLE-LEAP-YEAR
                                TO WS-DTE-TABLE.
    IF  WS-DTE-DDM (X-WS-DTE-DOM) IS EQUAL TO WS-DTE-JULDAYS
        MOVE WS-DTE-TABLE-REGULAR-YEAR
                                TO WS-DTE-TABLE
        GO TO CPS559-FSD-ASDR-EXIT.
    MOVE WS-DTE-TABLE-REGULAR-YEAR
                                TO WS-DTE-TABLE.
    MOVE CPS359-F-CALC-STMT-DTE TO WS-DTE-JULIAN.
    MOVE 1                      TO WS-DTE-FREQ.
    MOVE 'D'                    TO WS-DTE-PERIOD.
    PERFORM CCSI-FUTURE-DATE THRU CCSI-FD-EXIT.
    MOVE WS-DTE-JULIAN          TO CPS359-F-CALC-STMT-DTE.
    PERFORM CCSI-DAY-OF-WEEK THRU CCSI-DOW-EXIT.
    IF  (WS-DTE-DOW IS EQUAL TO 0) AND
        (OC-WORK-WEEK-R (1) IS EQUAL TO 'C')
        GO TO CPS559-FSD-ADJST-STMT-DTE-RTN.
    IF  (WS-DTE-DOW IS EQUAL TO 1) AND
        (OC-WORK-WEEK-R (2) IS EQUAL TO 'C')
        GO TO CPS559-FSD-ADJST-STMT-DTE-RTN.
    IF  (WS-DTE-DOW IS EQUAL TO 2) AND
        (OC-WORK-WEEK-R (3) IS EQUAL TO 'C')
        GO TO CPS559-FSD-ADJST-STMT-DTE-RTN.
    IF  (WS-DTE-DOW IS EQUAL TO 3) AND
        (OC-WORK-WEEK-R (4) IS EQUAL TO 'C')
        GO TO CPS559-FSD-ADJST-STMT-DTE-RTN.
    IF  (WS-DTE-DOW IS EQUAL TO 4) AND
        (OC-WORK-WEEK-R (5) IS EQUAL TO 'C')
        GO TO CPS559-FSD-ADJST-STMT-DTE-RTN.
    IF  (WS-DTE-DOW IS EQUAL TO 5) AND
        (OC-WORK-WEEK-R (6) IS EQUAL TO 'C')
        GO TO CPS559-FSD-ADJST-STMT-DTE-RTN.
    IF  (WS-DTE-DOW IS EQUAL TO 6) AND
        (OC-WORK-WEEK-R (7) IS EQUAL TO 'C')
        GO TO CPS559-FSD-ADJST-STMT-DTE-RTN.
    MOVE 0                      TO CPS359-F-HOLIDAY-SW.
    MOVE CPS359-F-CALC-STMT-DTE TO WS-DTE-JULIAN.
    PERFORM CCSI-JUL-TO-GREG THRU CCSI-JTG-EXIT.
    PERFORM CPS559-FSD-ORG-HOLIDAY-CHECK THRU CPS559-FSD-OHC-EXIT
        VARYING CPS359-F-HOLIDAY-SUB FROM 1 BY 1
            UNTIL (CPS359-F-HOLIDAY-SW  IS EQUAL TO 1) OR
                  (CPS359-F-HOLIDAY-SUB IS GREATER THAN 16).
    IF  CPS359-F-HOLIDAY-SW IS EQUAL TO 1
        GO TO CPS559-FSD-ADJST-STMT-DTE-RTN.
    MOVE CPS359-F-CALC-STMT-DTE TO WS-DTE-JULIAN.
    MOVE 1                      TO WS-DTE-FREQ.
    MOVE 'D'                    TO WS-DTE-PERIOD.
    PERFORM CCSI-BACKUP-DATE THRU CCSI-BD-EXIT.
    MOVE WS-DTE-JULIAN          TO CPS359-F-CALC-STMT-DTE.
CPS559-FSD-ASDR-EXIT.
    EXIT.
