GET-SUSPENSE-ACCOUNT.                                            
    IF  CMT-ORGN-NMBR  EQUAL TO OC-ORGN-NMBR                     
        MOVE  998            TO WS-CPS700-TYPE-NMBR              
        MOVE  OC-SUS-ACCT    TO WS-CPS700-CARD-NMBR              
    ELSE                                                         
            MOVE ZERO       TO WS-CPS700-TYPE-NMBR               
            MOVE ZERO       TO WS-CPS700-CARD-NMBR               
    END-IF.                                                      
GSA-XIT.                                                         
    EXIT.                                                        
