CCS-CMA-RECORD-ADD.                                              
    IF  CMA-HEADER-TYPE OR CMA-TRAILER-TYPE                      
        WRITE CMA-ADDIT-INFO-RECORD                              
        GO TO CCS-CMA-CHECK-ADD.                                 
    IF  CMA-INSURANCE                                            
        MOVE  CMA-INS-NO-PLANS  TO CMA-FD-INS-NO-PLANS           
        WRITE CMA-FD-INS-RECORD FROM CMA-INSURANCE-RECORD        
        GO TO CCS-CMA-CHECK-ADD.                                 
    IF  CMA-FIXED-TERM                                           
        WRITE CMA-FD-FTL-RECORD FROM CMA-FIXED-TERM-RECORD       
        GO TO CCS-CMA-CHECK-ADD.                                 
    MOVE 9 TO WS-IO-COMPLETE-SW.                                 
    GO TO CCS-CMA-ADD-EXIT.                                      
CCS-CMA-CHECK-ADD.                                               
    IF  WS-CPCMA-STATUS IS EQUAL TO 22                           
        MOVE 3 TO WS-IO-COMPLETE-SW                              
        GO TO CCS-CMA-ADD-EXIT.                                  
    IF  WS-CPCMA-STATUS IS EQUAL TO ZERO                         
        MOVE 1 TO WS-IO-COMPLETE-SW                              
        GO TO CCS-CMA-ADD-EXIT.                                  
    MOVE WS-CPCMA-STATUS TO WS-ABEND-STATUS                      
    MOVE 5 TO WS-IO-COMPLETE-SW.                                 
CCS-CMA-ADD-EXIT.                                                
    EXIT.                                                        
CCS-CMA-UPDATE.                                                  
    IF  CMA-HEADER-TYPE OR CMA-TRAILER-TYPE                      
        REWRITE CMA-ADDIT-INFO-RECORD                            
        GO TO CCS-CMA-CHECK-UPD.                                 
    IF  CMA-INSURANCE                                            
        MOVE  CMA-INS-NO-PLANS  TO CMA-FD-INS-NO-PLANS           
        REWRITE CMA-FD-INS-RECORD FROM CMA-INSURANCE-RECORD      
        GO TO CCS-CMA-CHECK-UPD.                                 
    IF  CMA-FIXED-TERM                                           
        REWRITE CMA-FD-FTL-RECORD FROM CMA-FIXED-TERM-RECORD     
        GO TO CCS-CMA-CHECK-UPD.                                 
    MOVE 9 TO WS-IO-COMPLETE-SW.                                 
    GO TO CCS-CMA-UPD-EXIT.                                      
CCS-CMA-CHECK-UPD.                                               
    IF  WS-CPCMA-STATUS IS EQUAL TO 23                           
        MOVE 4 TO WS-IO-COMPLETE-SW                              
        GO TO CCS-CMA-UPD-EXIT.                                  
    IF  WS-CPCMA-STATUS IS EQUAL TO ZERO                         
        MOVE 1 TO WS-IO-COMPLETE-SW                              
        GO TO CCS-CMA-UPD-EXIT.                                  
    MOVE WS-CPCMA-STATUS TO WS-ABEND-STATUS                      
    MOVE 5 TO WS-IO-COMPLETE-SW.                                 
CCS-CMA-UPD-EXIT.                                                
    EXIT.                                                        
