S200-CALCULATE-INSTL-AMOUNTS.                                    
    IF  WS-INT-FREE-MOS > 0                                      
        COMPUTE WS-FIRST-INST-AMT ROUNDED =                      
                WS-PRINCIPAL / WS-PAY-TERM                       
        IF  WS-PAY-TERM = WS-INT-FREE-MOS                        
            MOVE 0              TO WS-INTR-RATE                  
        ELSE                                                     
            COMPUTE WS-PRINCIPAL ROUNDED =                       
                    WS-PRINCIPAL -                               
                   (WS-FIRST-INST-AMT * WS-INT-FREE-MOS)         
            COMPUTE WS-PAY-TERM = WS-PAY-TERM - WS-INT-FREE-MOS  
    ELSE                                                         
        COMPUTE WS-FIRST-INST-AMT ROUNDED = (WS-PRINCIPAL +      
               (WS-PRINCIPAL * WS-INTR-RATE * WS-PAY-TERM)) /    
                WS-PAY-TERM.                                     
    IF  WS-COMPUTE-METHOD = 01                                   
        MOVE 0                  TO WS-SUM                        
        MOVE 1                  TO WS-S1                         
        PERFORM WS-PAY-TERM TIMES                                
          COMPUTE WS-S1  ROUNDED = (WS-S1 / (1 + WS-INTR-RATE))  
          COMPUTE WS-SUM ROUNDED = WS-SUM + WS-S1                
        END-PERFORM                                              
        MOVE WS-PRINCIPAL       TO WS-OUTS-BAL                   
        COMPUTE WS-MTHLY-INST-AMT ROUNDED =                      
                WS-PRINCIPAL / WS-SUM                            
        IF  WS-INT-FREE-MOS = 0                                  
            MOVE WS-MTHLY-INST-AMT                               
                                TO WS-FIRST-INST-AMT             
        END-IF                                                   
        MOVE 0                  TO WS-CNT                        
        PERFORM S300-CALCULATE-LST-INSTL-PYMT                    
                THRU S300-CLIP-EXIT  WS-PAY-TERM TIMES.          
    IF  WS-COMPUTE-METHOD = 02                                   
        COMPUTE WS-OUTS-INT ROUNDED =                            
               (WS-PRINCIPAL * WS-INTR-RATE * WS-PAY-TERM)       
        COMPUTE WS-MTHLY-INST-AMT ROUNDED = (WS-PRINCIPAL +      
               (WS-PRINCIPAL * WS-INTR-RATE * WS-PAY-TERM)) /    
                WS-PAY-TERM                                      
            COMPUTE WS-REMAINDER = (WS-FIRST-INST-AMT *          
                    WS-INT-FREE-MOS) +                           
                    (WS-MTHLY-INST-AMT * WS-PAY-TERM) -          
                    (WS-PRINCIPAL +                              
                    (WS-PRINCIPAL * WS-INTR-RATE * WS-PAY-TERM)) 
        ELSE                                                     
        COMPUTE WS-REMAINDER ROUNDED = (WS-MTHLY-INST-AMT *      
                WS-PAY-TERM) - (WS-PRINCIPAL +                   
               (WS-PRINCIPAL * WS-INTR-RATE * WS-PAY-TERM))      
        END-IF                                                   
        COMPUTE WS-LAST-INST-AMT ROUNDED = WS-MTHLY-INST-AMT -   
                WS-REMAINDER.                                    
S200-CIA-EXIT.                                                   
    EXIT.                                                        
S300-CALCULATE-LST-INSTL-PYMT.                                   
    ADD 1 TO WS-CNT.                                             
    COMPUTE WS-INT-AMT  ROUNDED = WS-OUTS-BAL * WS-INTR-RATE.    
    COMPUTE WS-OUTS-INT ROUNDED = WS-OUTS-INT + WS-INT-AMT.      
    COMPUTE WS-PRIN-AMT ROUNDED = WS-MTHLY-INST-AMT - WS-INT-AMT.
    COMPUTE WS-OUTS-BAL ROUNDED = WS-OUTS-BAL - WS-PRIN-AMT.     
        COMPUTE WS-LAST-INST-AMT ROUNDED = WS-OUTS-BAL +         
                WS-PRIN-AMT + WS-INT-AMT.                        
S300-CLIP-EXIT.                                                  
    EXIT.                                                        
