LOAD-INSTL-CHANNEL-AMT-TABLE.                                    
READ-INSTL-CHANNEL-AMT-FILE.                                     
    READ CEPP-CHANEL-EPTAPMP    NEXT AT END                      
      MOVE 'Y'                    TO    WS-EPTAPMP-EOF           
      GO TO LICAT-XIT.                                           
    IF WS-EPTAPMP-STATUS  = 00                                   
       NEXT SENTENCE                                             
    ELSE                                                         
       MOVE 'Y'                   TO    WS-EPTAPMP-EOF           
       GO                         TO    LICAT-XIT                
    END-IF.                                                      
    IF EPTAPMP-ORG  = ZERO                                       
       GO TO READ-INSTL-CHANNEL-AMT-FILE                         
    END-IF.                                                      
    IF EPTAPMP-ORG  = WS-CURR-CODE(1) AND                        
       EPTAPMP-INSTL-TYPE  = 'A'                                 
       CONTINUE                                                  
    ELSE                                                         
       GO TO READ-INSTL-CHANNEL-AMT-FILE                         
    END-IF.                                                      
    IF EPTAPMP-ORG   = 999                                       
       MOVE 'Y'                   TO    WS-EPTAPMP-EOF           
       GO TO LICAT-XIT                                           
    END-IF.                                                      
    IF WSIS-SUB1  >= 150                                         
       GO TO LICAT-XIT                                           
    END-IF.                                                      
                                                                 
    MOVE 'Y'                      TO  WS-EPTAPMP-FOUND-FLAG.     
    ADD     1                     TO  WSIS-SUB1.                 
    MOVE EP-TAP-MAP-RECORD        TO  WSISA-REC (WSIS-SUB1).     
LICAT-XIT.                                                       
    EXIT.                                                        
LOAD-INSTL-PLAN-TABLE.                                           
READ-INSTL-PLAN-FILE.                                            
    READ CEPP-NUMBER-EPITYPE NEXT AT END                         
      MOVE 'Y'                   TO    WS-EPITYPE-EOF            
      GO                         TO    LIPT-XIT.                 
    IF WS-EPITYPE-STATUS  = 00                                   
       NEXT SENTENCE                                             
    ELSE                                                         
       MOVE 'Y'                   TO    WS-EPITYPE-EOF           
       GO                         TO    LIPT-XIT                 
    END-IF.                                                      
    IF EPP-ACCT-ORG IS NOT NUMERIC                               
       GO TO READ-INSTL-PLAN-FILE                                
    END-IF.                                                      
    IF EPP-ACCT-ORG  = WS-CURR-CODE(1) AND                       
       EPP-PLAN-TYPE       = 'C'                                 
       CONTINUE                                                  
    ELSE                                                         
       GO TO READ-INSTL-PLAN-FILE                                
    END-IF.                                                      
    IF EPP-ACCT-ORG  = 999                                       
       MOVE 'Y'                   TO    WS-EPITYPE-EOF           
       GO TO LIPT-XIT                                            
    END-IF.                                                      
    IF WSIS-SUB1  >= 150                                         
       GO TO LIPT-XIT                                            
    END-IF.                                                      
    MOVE 'Y'                      TO  WS-EPITYPE-FOUND-FLAG.     
    ADD     1                     TO  WSIS-SUB1.                 
    MOVE EPP-PLAN-REC             TO  WSISC-REC (WSIS-SUB1).     
LIPT-XIT.                                                        
    EXIT.                                                        
INIT-ORG-INST-PLAN-FIELDS.                                       
    PERFORM  INIT-ORG-INST-LEVEL  THRU IOIL-EXIT                 
      VARYING WSIS-SUB1           FROM  1 BY 1                   
      UNTIL WSIS-SUB1             >     150.                     
IOIPF-XIT.                                                       
    EXIT.                                                        
INIT-ORG-INST-LEVEL.                                             
    MOVE ZEROS          TO WSISA-ORG           (WSIS-SUB1)       
    MOVE SPACES         TO WSISA-CHANNEL       (WSIS-SUB1)       
    MOVE SPACES         TO WSISA-INSTL-TYPE    (WSIS-SUB1)       
    MOVE ZEROS          TO WSISA-PAYMENT-TERM  (WSIS-SUB1)       
    MOVE SPACES         TO WSISA-ACTIVE-FLAG   (WSIS-SUB1)       
    MOVE SPACES         TO WSISA-MAINT-USERID  (WSIS-SUB1)       
    MOVE ZEROS          TO WSISA-MAINT-DATE    (WSIS-SUB1)       
    MOVE ZEROS          TO WSISA-MAINT-TIME    (WSIS-SUB1)       
    PERFORM  INIT-ORG-INST-LEVEL-TBL    THRU IOILT-EXIT          
    VARYING  WSIS-SUB2 FROM 1 BY 1 UNTIL WSIS-SUB2 > 10.         
    MOVE ZEROS  TO WSISC-ACCT-ORG              (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-ACCT-PLAN             (WSIS-SUB1)       
    MOVE SPACES TO WSISC-PLAN-DESCRIPTION      (WSIS-SUB1)       
    MOVE SPACES TO WSISC-PLAN-TYPE             (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-PLAN-COMPUTE-METHOD   (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-PLAN-THRESHOLD-FROM   (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-PLAN-THRESHOLD-TO     (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-03-MOS-INTEREST       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-03-MOS-FREE-INTR      (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-06-MOS-INTEREST       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-06-MOS-FREE-INTR      (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-09-MOS-INTEREST       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-09-MOS-FREE-INTR      (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-12-MOS-INTEREST       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-12-MOS-FREE-INTR      (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-15-MOS-INTEREST       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-15-MOS-FREE-INTR      (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-18-MOS-INTEREST       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-18-MOS-FREE-INTR      (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-21-MOS-INTEREST       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-21-MOS-FREE-INTR      (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-24-MOS-INTEREST       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-24-MOS-FREE-INTR      (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-27-MOS-INTEREST       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-27-MOS-FREE-INTR      (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-30-MOS-INTEREST       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-30-MOS-FREE-INTR      (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-33-MOS-INTEREST       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-33-MOS-FREE-INTR      (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-36-MOS-INTEREST       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-36-MOS-FREE-INTR      (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-42-MOS-INTEREST       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-42-MOS-FREE-INTR      (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-48-MOS-INTEREST       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-48-MOS-FREE-INTR      (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-VALID-FROM-DTE        (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-VALID-TO-DTE          (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-LAST-MAINT-DATE       (WSIS-SUB1)       
    MOVE SPACES TO WSISC-LAST-USER             (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-HANDLING-FEE          (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-03-WAIVE-FR-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-03-WAIVE-TO-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-06-WAIVE-FR-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-06-WAIVE-TO-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-09-WAIVE-FR-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-09-WAIVE-TO-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-12-WAIVE-FR-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-12-WAIVE-TO-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-15-WAIVE-FR-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-15-WAIVE-TO-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-18-WAIVE-FR-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-18-WAIVE-TO-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-21-WAIVE-FR-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-21-WAIVE-TO-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-24-WAIVE-FR-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-24-WAIVE-TO-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-27-WAIVE-FR-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-27-WAIVE-TO-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-30-WAIVE-FR-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-30-WAIVE-TO-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-33-WAIVE-FR-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-33-WAIVE-TO-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-36-WAIVE-FR-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-36-WAIVE-TO-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-42-WAIVE-FR-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-42-WAIVE-TO-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-48-WAIVE-FR-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-48-WAIVE-TO-MOS       (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-HANDLING-FEE-IND      (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-FEE-PERCENT           (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-FEE-METHOD            (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-TRAN-SPAN-LIMT-DAYS   (WSIS-SUB1)       
    MOVE ZEROS  TO WSISC-INST-PERCENT          (WSIS-SUB1).      
IOIL-EXIT.                                                       
    EXIT.                                                        
INIT-ORG-INST-LEVEL-TBL.                                         
    MOVE ZEROS  TO  WSISA-INSTL-LIMIT (WSIS-SUB1,WSIS-SUB2).     
    MOVE ZEROS  TO  WSISA-INSTL-PLAN  (WSIS-SUB1,WSIS-SUB2).     
IOILT-EXIT.                                                      
    EXIT.                                                        
TYPE-INSTL-PLAN-OPTION.                                          
    MOVE 'N'                TO    WS-MATCHED-EPTAPMP-TBL.        
    IF  WS-EPTAPMP-FOUND-FLAG  = 'Y' AND                         
        WS-EPITYPE-FOUND-FLAG  = 'Y'                             
       CONTINUE                                                  
    ELSE                                                         
       GO TO TIPO-XIT                                            
    END-IF.                                                      
    IF  TC-EPYMT-TYPE               AND                          
       (TC-EPYMT-FLOOR IS NUMERIC ) AND                          
       (TC-EPYMT-TERM  IS NUMERIC ) AND                          
       (TC-EPYMT-PERCENT IS NUMERIC )                            
       CONTINUE                                                  
    ELSE                                                         
       GO TO TIPO-XIT                                            
    END-IF.                                                      
    IF CM-EPYMT-TERM IS NUMERIC     AND                          
       CM-EPYMT-TERM >  0                                        
       MOVE CM-EPYMT-TERM TO WSIS-EPYMT-TERM                     
    ELSE                                                         
       MOVE TC-EPYMT-TERM TO WSIS-EPYMT-TERM                     
    END-IF.                                                      
    PERFORM SEARCH-EPTAPMP-TBL                                   
       VARYING WSIS-SUB1     FROM  1 BY 1                        
        UNTIL WS-MATCHED-EPTAPMP-TBL =   'Y'                     
        OR WSIS-SUB1          >     150.                         
    IF (WSIS-INSTL-LIMIT    (1)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-PLAN     (1)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-LIMIT    (2)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-PLAN     (2)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-LIMIT    (3)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-PLAN     (3)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-LIMIT    (4)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-PLAN     (4)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-LIMIT    (5)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-PLAN     (5)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-LIMIT    (6)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-PLAN     (6)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-LIMIT    (7)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-PLAN     (7)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-LIMIT    (8)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-PLAN     (8)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-LIMIT    (9)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-PLAN     (9)    IS NOT NUMERIC)  OR           
       (WSIS-INSTL-LIMIT    (10)   IS NOT NUMERIC)  OR           
       (WSIS-INSTL-PLAN     (10)   IS NOT NUMERIC)               
        MOVE 'N' TO WS-MATCHED-EPTAPMP-TBL                       
    END-IF.                                                      
TIPO-XIT.                                                        
    EXIT.                                                        
SEARCH-EPTAPMP-TBL.                                              
    IF  TC-ORGN-NMBR       = WSISA-ORG          (WSIS-SUB1)      
    AND WSIS-EPYMT-TERM    = WSISA-PAYMENT-TERM (WSIS-SUB1)      
    AND TC-EPYMT-CHANNEL   = WSISA-CHANNEL      (WSIS-SUB1)      
        MOVE 'Y'             TO WS-MATCHED-EPTAPMP-TBL           
        MOVE WSISA-MAP-MATRIX (WSIS-SUB1)                        
                             TO WSIS-MAP-MATRIX                  
    END-IF.                                                      
SET-EXIT.                                                        
    EXIT.                                                        
FIND-INSTL-PLAN-TBL.                                             
    MOVE 'N' TO WSIS-FND-SW.                                     
    MOVE 'N' TO WSIS-FND-PLAN-SW.                                
    MOVE  1  TO WSIS-SUB1.                                       
    PERFORM UNTIL WSIS-FND-SW      = 'Y' OR                      
                  WSIS-SUB1  > 10                                
      IF  WSIS-SUB1   = 10 OR                                    
         (WSIS-INSTL-LIMIT    (WSIS-SUB1 + 1) = 999999999.99 AND 
          WSIS-INSTL-PLAN     (WSIS-SUB1 + 1) = ZEROS)           
          IF  WSIS-STMT-AVL-INSTL-AMT IS NOT GREATER THAN        
              WSIS-INSTL-LIMIT    (WSIS-SUB1)                    
              MOVE WSIS-INSTL-PLAN    (WSIS-SUB1)                
                                      TO WSIS-INSTL-PLAN-USE     
          END-IF                                                 
          MOVE 'Y'                    TO WSIS-FND-SW             
      ELSE                                                       
          IF  WSIS-STMT-AVL-INSTL-AMT  <                         
              WSIS-INSTL-LIMIT    (WSIS-SUB1)                    
              MOVE WSIS-INSTL-PLAN    (WSIS-SUB1)                
                                      TO WSIS-INSTL-PLAN-USE     
              MOVE 'Y'                TO WSIS-FND-SW             
          END-IF                                                 
      END-IF                                                     
      ADD  +1                         TO WSIS-SUB1               
    END-PERFORM.                                                 
                                                                 
    IF  WSIS-INSTL-PLAN-USE    > 0                               
    AND WSIS-FND-SW = 'Y'                                        
        CONTINUE                                                 
    ELSE                                                         
        MOVE 'N'                      TO WSIS-FND-SW             
        GO TO FIPT-XIT                                           
    END-IF.                                                      
                                                                 
    MOVE  1                           TO WSIS-SUB1.              
    PERFORM UNTIL WSIS-FND-PLAN-SW = 'Y' OR                      
                  WSIS-SUB1  > 150                               
      IF  WSISC-ACCT-ORG  (WSIS-SUB1) = WS-CURR-CODE(1)          
      AND WSISC-ACCT-PLAN (WSIS-SUB1) = WSIS-INSTL-PLAN-USE      
          MOVE WSISC-REC  (WSIS-SUB1)                            
                                  TO WSIS-PLAN-REC               
          MOVE 'Y'                TO WSIS-FND-PLAN-SW            
      END-IF                                                     
      ADD  +1                         TO WSIS-SUB1               
    END-PERFORM.                                                 
    IF (WSIS-PLAN-COMPUTE-METHOD   IS NOT NUMERIC)  OR           
       (WSIS-HANDLING-FEE          IS NOT NUMERIC)  OR           
       (WSIS-HANDLING-FEE-IND      IS NOT NUMERIC)  OR           
       (WSIS-FEE-PERCENT           IS NOT NUMERIC)  OR           
       (WSIS-FEE-METHOD            IS NOT NUMERIC)  OR           
       (WSIS-INST-PERCENT          IS NOT NUMERIC)               
        MOVE 'N' TO WSIS-FND-PLAN-SW                             
    END-IF.                                                      
FIPT-XIT.                                                        
    EXIT.                                                        
CHECK-INST-STMT-ACCT-PROCESS.                                    
    MOVE 'N'     TO WSIS-FND-PLAN-SW.                            
    MOVE ZEROS   TO WS-INSTL-ERR-RPT-NBR.                        
    IF ((CM-CORP-ACCT-NMBR = ZEROS) OR                           
        (CM-CORP-ACCT-NMBR = SPACE) OR                           
        (CM-CORP-ACCT-NMBR = LOW-VALUE)) AND                     
       CM-ORG-NMBR        = WS-CURR-CODE(1)                      
       CONTINUE                                                  
    ELSE                                                         
       GO TO CISAP-XIT                                           
    END-IF.                                                      
    IF TC-EPYMT-TYPE AND STATEMENT-TODAY                         
       CONTINUE                                                  
    ELSE                                                         
       GO TO CISAP-XIT                                           
    END-IF.                                                      
    INITIALIZE WSIS-WS  REPLACING NUMERIC BY ZEROES              
                                  ALPHANUMERIC BY SPACES.        
    IF TC-EPYMT-AMT-FLAG = '1'                                   
       COMPUTE  WSIS-STMT-AVL-INSTL-AMT ROUNDED =                
                CM-RTL-CURR-INST-BAL *                           
                TC-EPYMT-PERCENT / 100                           
    ELSE                                                         
       MOVE +3610                   TO CPS422-FUNCTION-CODE      
       PERFORM ABPS-MAIN-FUNCTION THRU ABPS-MF-XIT               
                                                                 
       COMPUTE  WSIS-STMT-AVL-INSTL-AMT ROUNDED =                
            (CM-RTL-CURR-MON-BAL   +                             
             CM-RTL-PRIN-STMT      +                             
             WS-RABP-NOR-PRIN-STMT +                             
             WS-RABP-NOR-CURR-MON) *                             
             TC-EPYMT-PERCENT / 100                              
    END-IF.                                                      
    MOVE WSIS-STMT-AVL-INSTL-AMT  TO WSIS-STMT-AVL-INSTL-AMT1.   
    COMPUTE  WSIS-CM-AVAIL-INSTL ROUNDED =                       
         TCM-INSTL-LIMIT-PERCENT * CM-CRLIMIT -                  
         CM-INSTL-BAL        - CM-CSH-INSTL-BAL -                
         CM-AMNT-OUTST-INSTL - CM-AMNT-OUTST-CSH-INSTL.          
    IF CM-BLOCK-CODE NOT = SPACES                                
       MOVE 01      TO WS-INSTL-ERR-RPT-NBR                      
       GO TO CISAP-XIT                                           
    END-IF.                                                      
    IF CM-CURR-DUE  > 0                                          
       MOVE 02      TO WS-INSTL-ERR-RPT-NBR                      
       GO TO CISAP-XIT                                           
    END-IF.                                                      
    IF CM-CR-INST-BLOCK-FLAG NOT = SPACES                        
       MOVE 03      TO WS-INSTL-ERR-RPT-NBR                      
       GO TO CISAP-XIT                                           
    END-IF.                                                      
    IF CM-PL-INST-BLOCK-FLAG NOT = SPACES                        
       MOVE 04      TO WS-INSTL-ERR-RPT-NBR                      
       GO TO CISAP-XIT                                           
    END-IF.                                                      
    IF WSIS-STMT-AVL-INSTL-AMT <= 0                              
       MOVE 05      TO WS-INSTL-ERR-RPT-NBR                      
       GO TO CISAP-XIT                                           
    END-IF.                                                      
    IF WSIS-CM-AVAIL-INSTL     <= 0                              
       MOVE 06      TO WS-INSTL-ERR-RPT-NBR                      
       GO TO CISAP-XIT                                           
    END-IF.                                                      
    IF WSIS-STMT-AVL-INSTL-AMT >   WSIS-CM-AVAIL-INSTL           
       MOVE 10      TO WS-INSTL-ERR-RPT-NBR                      
       MOVE WSIS-CM-AVAIL-INSTL  TO WSIS-STMT-AVL-INSTL-AMT      
    END-IF.                                                      
    IF WSIS-STMT-AVL-INSTL-AMT < TC-EPYMT-FLOOR                  
       MOVE 07      TO WS-INSTL-ERR-RPT-NBR                      
       GO TO CISAP-XIT                                           
    END-IF.                                                      
    PERFORM TYPE-INSTL-PLAN-OPTION THRU TIPO-XIT.                
    IF WS-MATCHED-EPTAPMP-TBL  = 'Y'                             
       CONTINUE                                                  
    ELSE                                                         
       MOVE 08      TO WS-INSTL-ERR-RPT-NBR                      
       GO TO CISAP-XIT                                           
    END-IF.                                                      
    PERFORM FIND-INSTL-PLAN-TBL  THRU FIPT-XIT.                  
    IF WSIS-FND-PLAN-SW   = 'Y'                                  
       CONTINUE                                                  
    ELSE                                                         
       MOVE 09      TO WS-INSTL-ERR-RPT-NBR                      
       GO TO CISAP-XIT                                           
    END-IF.                                                      
    MOVE WSIS-ACCT-PLAN         TO WSIE-INSTL-PLAN.              
    MOVE ZEROS                  TO WS-INTR-RATE.                 
    MOVE WSIS-STMT-AVL-INSTL-AMT TO WS-PRINCIPAL                 
                                   WSIE-ITEM-PRICE               
                                   WS-OUTS-BAL                   
                                   WS-OUTS-PRINCIPAL.            
    MOVE ZEROS                  TO WS-OUTS-INT.                  
    MOVE WSIS-EPYMT-TERM        TO WSIE-PAY-TERM                 
                                   WS-PAY-TERM.                  
    MOVE 00                     TO WS-INT-FREE-MOS.              
    MOVE 01                     TO WS-COMPUTE-METHOD.            
    PERFORM S200-CALCULATE-INSTL-AMOUNTS THRU S200-CIA-EXIT.     
    MOVE WS-FIRST-INST-AMT      TO WSIE-FIRST-PAY-AMT.           
    MOVE WS-MTHLY-INST-AMT      TO WSIE-MON-INSTL-AMT.           
    MOVE WS-LAST-INST-AMT       TO WSIE-LAST-PAY-AMT.            
    MOVE WS-OUTS-INT            TO WSIE-OUTS-INT.                
    MOVE OC-ACCR-THRU-DTE       TO WSIE-FIRST-PAY-DATE.          
    MOVE WSIE-FIRST-PAY-DATE TO WS-DTE-JULIAN.                   
    COMPUTE WS-DTE-FREQ = WSIE-PAY-TERM - 1                      
    MOVE 'M'                    TO WS-DTE-PERIOD                 
    PERFORM CCSI-FUTURE-DATE THRU CCSI-FD-EXIT                   
    MOVE WS-DTE-JULIAN          TO WSIE-LAST-PAY-DATE.           
    IF WSIS-FEE-METHOD        =  0  AND                          
       WSIS-HANDLING-FEE-IND  =  0                               
       MOVE 2                   TO WSIE-FEE-IND                  
    ELSE                                                         
       IF WSIS-FEE-METHOD        =  0  AND                       
          WSIS-HANDLING-FEE-IND  =  1                            
          MOVE 1                TO WSIE-FEE-IND                  
       ELSE                                                      
          IF WSIS-FEE-METHOD        =  1  AND                    
             WSIS-HANDLING-FEE-IND  =  0                         
             MOVE 4             TO WSIE-FEE-IND                  
          ELSE                                                   
             IF WSIS-FEE-METHOD        =  1  AND                 
                WSIS-HANDLING-FEE-IND  =  1                      
                MOVE 3          TO WSIE-FEE-IND                  
             END-IF                                              
          END-IF                                                 
       END-IF                                                    
    END-IF.                                                      
    IF WSIS-FEE-METHOD           = 0                             
       IF WSIS-HANDLING-FEE-IND  = 1                             
          COMPUTE WSIE-HANDLING-FEE ROUNDED =                    
                  WSIE-ITEM-PRICE * WSIS-FEE-PERCENT / 1000000   
       ELSE                                                      
          MOVE WSIS-HANDLING-FEE TO WSIE-HANDLING-FEE            
       END-IF                                                    
    END-IF.                                                      
                                                                 
    IF WSIS-FEE-METHOD           = 1                             
       IF WSIS-HANDLING-FEE-IND  = 1                             
          COMPUTE WSIE-MON-RATE    ROUNDED =                     
                  WSIS-FEE-PERCENT / 1000000                     
          COMPUTE WSIE-MON-FEE     ROUNDED =                     
                  WSIE-ITEM-PRICE * WSIS-FEE-PERCENT / 1000000   
       ELSE                                                      
          MOVE ZEROS            TO WSIE-MON-RATE                 
          MOVE WSIS-HANDLING-FEE TO WSIE-MON-FEE                 
       END-IF                                                    
    ELSE                                                         
       MOVE ZEROS               TO WSIE-MON-RATE                 
    END-IF                                                       
    PERFORM INST-STMT-GEN-TRAN THRU ISGT-XIT.                    
CISAP-XIT.                                                       
    EXIT.                                                        
INST-STMT-GEN-TRAN.                                              
    MOVE MONETARY-TRANSACTION   TO WS-TRANS-HOLD-4.              
    MOVE 'Y'                    TO WS-PROCESSING-TRANS-SW.       
    MOVE WS-ORIG-POSTING-FLAG   TO WS-ORIG-POSTING-FLAG-HD.      
    MOVE ZEROS                  TO WS-ORIG-POSTING-FLAG.         
    ADD 50 TO WS-GPS861-REF-SEQ                                  
        ON SIZE ERROR     MOVE 1 TO WS-GPS861-REF-SEQ            
                          ADD  1 TO WS-GPS861-REF-BATCH.         
    PERFORM GENERATE-BASIC-TRANS  THRU  GBT-XIT.                 
    MOVE WSIS-STMT-AVL-INSTL-AMT TO GT-AMNT.                     
    MOVE 4001                   TO GT-TRANS-CODE.                
    MOVE 40                     TO GT-TRANS-TYPE.                
    MOVE SPACES                 TO GT-DESC.                      
    MOVE 'V&..+&'     TO GT-DESC.                      
    MOVE OC-ACCR-THRU-DTE       TO WS-DTE-JULIAN.                
    PERFORM CCSI-JUL-TO-GREG    THRU CCSI-JTG-EXIT.              
    MOVE WS-DTE-YYX             TO WS-DTE-YMD-YY.                
    MOVE WS-DTE-MMX             TO WS-DTE-YMD-MM.                
    MOVE WS-DTE-DDX             TO WS-DTE-YMD-DD.                
    MOVE WS-DTE-YMD             TO GT-DESC(17:6).                
    MOVE '$,.*|j.'        TO GT-DESC(23:).                 
    MOVE WS-CURR-CODE(1)        TO GT-MERCH-ORGN.                
    MOVE WS-INSTL-MERCH-NMBR    TO GT-MERCH-NMBR.                
    MOVE ZEROS                  TO WSTCR-SRCH-ORG.               
    MOVE GT-TRANS-CODE          TO WSTCR-SRCH-TXCD.              
    PERFORM LOCATE-TRANS-CODE-RTN  THRU LO-TRANS-CODE-EXIT.      
    MOVE TCR-BAL-PROG-ID        TO GT-BAL-PROG-ID.               
    IF  TCR-BAL-PROG-ID NOT EQUAL TO SPACE                       
        SET WS-ABP-TRANS-THRU   TO TRUE                          
    ELSE                                                         
        SET WS-ABP-TRANS-NOTHRU TO TRUE                          
    END-IF.                                                      
    MOVE SPACES                 TO WS-BAL-TYPE-TC.               
    MOVE SPACES                 TO WS-R-B-IND-TC.                
    MOVE TCR-BAL-TYPE           TO WS-BAL-TYPE-TC.               
    MOVE TCR-R-B-IND            TO WS-R-B-IND-TC.                
    MOVE 'N'                    TO WS-PRE-STMT-FLAG.             
    MOVE GENERATED-TRANSACTION  TO MONETARY-TRANSACTION.         
    MOVE WS-ORIG-CURR-DATA      TO CMT-ORIG-CURR-DATA.           
    MOVE '1'                    TO CMT-INSTALLMENT-IND.          
    PERFORM PROCESS-SALES  THRU  PSLS-XIT.                       
    PERFORM TRANSACTION-REPORTING THRU TR-XIT.                   
    MOVE GT-TRANS-CODE          TO WS-TRAN-CODE-GL.              
    PERFORM GENERATE-GEN-TRAN-GL THRU GGTG-XIT.                  
    PERFORM GGTG-UPD-CARDH-GL THRU GUCG-XIT.                     
    PERFORM BALANCING-ACCT-ROUTINE THRU BAL-ACC-EXIT.            
    ADD 1 TO WS-GPS861-REF-SEQ                                   
        ON SIZE ERROR     MOVE 1 TO WS-GPS861-REF-SEQ            
                          ADD  1 TO WS-GPS861-REF-BATCH.         
    MOVE MONETARY-TRANSACTION                                    
                                TO GENERATED-TRANSACTION.        
    MOVE CMT-INSTALLMENT-IND    TO GT-INSTALLMENT-IND.           
    MOVE  3                     TO WS-HIST-SW.                   
    PERFORM HISTORY-UPDATE THRU HU-XIT.                          
    PERFORM GENERATE-BASIC-TRANS  THRU  GBT-XIT.                 
    MOVE WSIS-STMT-AVL-INSTL-AMT TO GT-AMNT.                     
    MOVE 4300                   TO GT-TRANS-CODE.                
    MOVE 43                     TO GT-TRANS-TYPE.                
    MOVE SPACES                 TO GT-DESC.                      
    MOVE OC-ACCR-THRU-DTE       TO WS-DTE-JULIAN.                
    PERFORM CCSI-JUL-TO-GREG    THRU CCSI-JTG-EXIT.              
    MOVE WS-DTE-DMY             TO GT-DESC(4:6).                 
    MOVE '*<R<&'         TO GT-DESC(10:12).               
    MOVE WS-CURR-CODE(1)        TO GT-MERCH-ORGN.                
    MOVE ZEROS                  TO GT-MERCH-NMBR.                
    MOVE ZEROS                  TO WSTCR-SRCH-ORG.               
    MOVE GT-TRANS-CODE          TO WSTCR-SRCH-TXCD.              
    PERFORM LOCATE-TRANS-CODE-RTN  THRU LO-TRANS-CODE-EXIT.      
    MOVE TCR-BAL-PROG-ID        TO GT-BAL-PROG-ID.               
    IF  TCR-BAL-PROG-ID NOT EQUAL TO SPACE                       
        SET WS-ABP-TRANS-THRU   TO TRUE                          
    ELSE                                                         
        SET WS-ABP-TRANS-NOTHRU TO TRUE                          
    END-IF.                                                      
    MOVE SPACES                 TO WS-BAL-TYPE-TC.               
    MOVE SPACES                 TO WS-R-B-IND-TC.                
    MOVE TCR-BAL-TYPE           TO WS-BAL-TYPE-TC.               
    MOVE TCR-R-B-IND            TO WS-R-B-IND-TC.                
    MOVE 'N'                    TO WS-PRE-STMT-FLAG.             
    MOVE GENERATED-TRANSACTION  TO MONETARY-TRANSACTION.         
    MOVE WS-ORIG-CURR-DATA      TO CMT-ORIG-CURR-DATA.           
    MOVE 'N'                    TO WS-PRE-STMT-FLAG.             
    PERFORM PROCESS-RTL-ADJUST  THRU  PRA-XIT.                   
    PERFORM TRANSACTION-REPORTING THRU TR-XIT.                   
    MOVE GT-TRANS-CODE          TO WS-TRAN-CODE-GL.              
    PERFORM GENERATE-GEN-TRAN-GL THRU GGTG-XIT.                  
    PERFORM GGTG-UPD-CARDH-GL THRU GUCG-XIT.                     
    PERFORM BALANCING-ACCT-ROUTINE THRU BAL-ACC-EXIT.            
    ADD 1 TO WS-GPS861-REF-SEQ                                   
        ON SIZE ERROR     MOVE 1 TO WS-GPS861-REF-SEQ            
                          ADD  1 TO WS-GPS861-REF-BATCH.         
    MOVE MONETARY-TRANSACTION                                    
                                TO GENERATED-TRANSACTION.        
    MOVE CMT-INSTALLMENT-IND    TO GT-INSTALLMENT-IND.           
    MOVE  3                     TO WS-HIST-SW.                   
    PERFORM HISTORY-UPDATE THRU HU-XIT.                          
    PERFORM GENERATE-BASIC-TRANS  THRU  GBT-XIT.                 
    MOVE WS-FIRST-INST-AMT      TO GT-AMNT.                      
    MOVE 4099                   TO GT-TRANS-CODE.                
    MOVE 40                     TO GT-TRANS-TYPE.                
    MOVE +1                     TO GT-SOURCE-CODE.               
    MOVE SPACES                 TO GT-DESC.                      
    MOVE '..+&.R|j.'   TO GT-DESC.                      
    MOVE OC-ACCR-THRU-DTE       TO WS-DTE-JULIAN.                
    PERFORM CCSI-JUL-TO-GREG    THRU CCSI-JTG-EXIT.              
    MOVE WS-DTE-YYX             TO WS-DTE-YMD-YY.                
    MOVE WS-DTE-MMX             TO WS-DTE-YMD-MM.                
    MOVE WS-DTE-DDX             TO WS-DTE-YMD-DD.                
    MOVE WS-DTE-YMD             TO GT-DESC(19:6).                
    MOVE '$,.XX/XX '         TO GT-DESC(25:).                 
    MOVE '01'                   TO GT-DESC(31:2).                
    MOVE WSIS-EPYMT-TERM        TO GT-DESC(34:2)                 
    MOVE WS-CURR-CODE(1)        TO GT-MERCH-ORGN.                
    MOVE WS-INSTL-MERCH-NMBR    TO GT-MERCH-NMBR.                
    MOVE ZEROS                  TO WSTCR-SRCH-ORG.               
    MOVE GT-TRANS-CODE          TO WSTCR-SRCH-TXCD.              
    PERFORM LOCATE-TRANS-CODE-RTN  THRU LO-TRANS-CODE-EXIT.      
    MOVE TCR-BAL-PROG-ID        TO GT-BAL-PROG-ID.               
    IF  TCR-BAL-PROG-ID NOT EQUAL TO SPACE                       
        SET WS-ABP-TRANS-THRU   TO TRUE                          
    ELSE                                                         
        SET WS-ABP-TRANS-NOTHRU TO TRUE                          
    END-IF.                                                      
    MOVE SPACES                 TO WS-BAL-TYPE-TC.               
    MOVE SPACES                 TO WS-R-B-IND-TC.                
    MOVE TCR-BAL-TYPE           TO WS-BAL-TYPE-TC.               
    MOVE TCR-R-B-IND            TO WS-R-B-IND-TC.                
    MOVE 'N'                    TO WS-PRE-STMT-FLAG.             
    MOVE GENERATED-TRANSACTION  TO MONETARY-TRANSACTION.         
    MOVE ZEROES              TO CMT-WHSED-FLAG                   
                                CMT-POSTING-FLAG                 
                                CMT-REV-TRAN-ID                  
                                CMT-TRAN-ID                      
                                CMT-PYMT-TYPE-IND                
                                CMT-AHF-ORIG-CURR-CODE           
                                CMT-AHF-ORIG-CURR-AMT            
                                CMT-AHF-ORIG-CURR-DECIMAL        
                                CMT-AHF-ONUS-CURR-CONV           
                                CMT-ORIG-CURR-CODE               
                                CMT-ORIG-CURR-DECIMAL            
                                CMT-ONUS-CURR-CONV.              
    MOVE 1                   TO CMT-TRAN-TYPE.                   
    MOVE '2'                 TO CMT-INSTALLMENT-IND.             
    MOVE 'M'                 TO CMT-CARD-CARD-TYPE.              
    MOVE ZEROES              TO CMT-AUTH-AMT                     
                                CMT-AUTH-CCY                     
                                CMT-ORIG-SOURCE-CODE.            
    MOVE WS-ORIG-CURR-DATA      TO CMT-ORIG-CURR-DATA.           
    MOVE WS-FIRST-INST-AMT      TO CMT-PRINCIPAL-AMT.            
    PERFORM PROCESS-SALES  THRU  PSLS-XIT.                       
    PERFORM TRANSACTION-REPORTING THRU TR-XIT.                   
    MOVE GT-TRANS-CODE          TO WS-TRAN-CODE-GL.              
    PERFORM GENERATE-GEN-TRAN-GL THRU GGTG-XIT.                  
    PERFORM GGTG-UPD-CARDH-GL THRU GUCG-XIT.                     
    PERFORM BALANCING-ACCT-ROUTINE THRU BAL-ACC-EXIT.            
    ADD 1 TO WS-GPS861-REF-SEQ                                   
        ON SIZE ERROR     MOVE 1 TO WS-GPS861-REF-SEQ            
                          ADD  1 TO WS-GPS861-REF-BATCH.         
    MOVE MONETARY-TRANSACTION                                    
                                TO GENERATED-TRANSACTION.        
    MOVE CMT-INSTALLMENT-IND    TO GT-INSTALLMENT-IND.           
    MOVE  3                     TO WS-HIST-SW.                   
    PERFORM HISTORY-UPDATE THRU HU-XIT.                          
    IF  WSIE-HANDLING-FEE IS NUMERIC                             
    AND WSIE-HANDLING-FEE IS GREATER THAN ZERO                   
    AND WSIE-MON-FEE = ZERO                                      
        PERFORM GENERATE-TOTAL-FEE-TRANS  THRU  GTFT-XIT         
    END-IF.                                                      
    IF  WSIE-MON-FEE > 0                                         
        PERFORM GENERATE-MON-FEE-TRANS  THRU  GMFT-XIT           
    END-IF.                                                      
    MOVE 'N'                     TO WS-PROCESSING-TRANS-SW.      
    MOVE WS-TRANS-HOLD-4         TO MONETARY-TRANSACTION.        
    MOVE WS-ORIG-POSTING-FLAG-HD TO WS-ORIG-POSTING-FLAG.        
ISGT-XIT.                                                        
    EXIT.                                                        
GENERATE-TOTAL-FEE-TRANS.                                        
    PERFORM GENERATE-BASIC-TRANS  THRU  GBT-XIT.                 
    MOVE WSIE-HANDLING-FEE      TO GT-AMNT.                      
    MOVE 6043                   TO GT-TRANS-CODE.                
    MOVE 60                     TO GT-TRANS-TYPE.                
    MOVE 6043                   TO WSTCR-SRCH-TXCD.              
    PERFORM LOCATE-TRANS-CODE-RTN THRU LO-TRANS-CODE-EXIT.       
    MOVE  SPACES                TO GT-DESC.                      
    MOVE  WSIE-PAY-TERM         TO GT-DESC(1:2).                 
    MOVE  TCR-DESC              TO GT-DESC(3:38).                
    MOVE GT-DESC                TO WS-INPUT-DESC.                
    MOVE 24                     TO WS-DESC-LEN.                  
    PERFORM 9880-FORMAT-DESC    THRU 9880-EXIT.                  
    MOVE WS-OUTPUT-DESC         TO GT-DESC.                      
    MOVE OC-ACCR-THRU-DTE       TO WS-DTE-JULIAN                 
    PERFORM CCSI-JUL-TO-GREG    THRU CCSI-JTG-EXIT               
    MOVE WS-DTE-YYX             TO WS-DTE-YMD-YY                 
    MOVE WS-DTE-MMX             TO WS-DTE-YMD-MM                 
    MOVE WS-DTE-DDX             TO WS-DTE-YMD-DD                 
    MOVE WS-DTE-YMD             TO GT-DESC(25:6)                 
    MOVE '$,.'               TO GT-DESC(31:)                  
    MOVE WS-CURR-CODE(1)        TO GT-MERCH-ORGN.                
    MOVE ZEROS                  TO GT-MERCH-NMBR.                
    MOVE TCR-BAL-PROG-ID        TO GT-BAL-PROG-ID.               
    IF  TCR-BAL-PROG-ID NOT EQUAL TO SPACE                       
        SET WS-ABP-TRANS-THRU   TO TRUE                          
    ELSE                                                         
        SET WS-ABP-TRANS-NOTHRU TO TRUE                          
    END-IF.                                                      
    MOVE SPACES                 TO WS-BAL-TYPE-TC.               
    MOVE SPACES                 TO WS-R-B-IND-TC.                
    MOVE TCR-BAL-TYPE           TO WS-BAL-TYPE-TC.               
    MOVE TCR-R-B-IND            TO WS-R-B-IND-TC.                
    MOVE 'N'                    TO WS-PRE-STMT-FLAG.             
    MOVE GENERATED-TRANSACTION  TO MONETARY-TRANSACTION.         
    MOVE WS-ORIG-CURR-DATA      TO CMT-ORIG-CURR-DATA.           
    PERFORM PROCESS-MISC-FEES  THRU  PMF-XIT.                    
    PERFORM TRANSACTION-REPORTING THRU TR-XIT.                   
    MOVE GT-TRANS-CODE          TO WS-TRAN-CODE-GL.              
    PERFORM GENERATE-GEN-TRAN-GL THRU GGTG-XIT.                  
    PERFORM GGTG-UPD-CARDH-GL THRU GUCG-XIT.                     
    PERFORM BALANCING-ACCT-ROUTINE THRU BAL-ACC-EXIT.            
    ADD 1 TO WS-GPS861-REF-SEQ                                   
        ON SIZE ERROR     MOVE 1 TO WS-GPS861-REF-SEQ            
                          ADD  1 TO WS-GPS861-REF-BATCH.         
    MOVE MONETARY-TRANSACTION                                    
                                TO GENERATED-TRANSACTION.        
    MOVE CMT-INSTALLMENT-IND    TO GT-INSTALLMENT-IND.           
    MOVE  3                     TO WS-HIST-SW.                   
    PERFORM HISTORY-UPDATE THRU HU-XIT.                          
GTFT-XIT.                                                        
    EXIT.                                                        
GENERATE-MON-FEE-TRANS.                                          
    PERFORM GENERATE-BASIC-TRANS  THRU  GBT-XIT.                 
    MOVE WSIE-MON-FEE           TO GT-AMNT.                      
    MOVE 6042                   TO GT-TRANS-CODE.                
    MOVE 60                     TO GT-TRANS-TYPE.                
    MOVE 6042                   TO WSTCR-SRCH-TXCD.              
    PERFORM LOCATE-TRANS-CODE-RTN THRU LO-TRANS-CODE-EXIT.       
    MOVE  SPACES                TO GT-DESC.                      
    MOVE  TCR-DESC              TO GT-DESC.                      
    MOVE GT-DESC                TO WS-INPUT-DESC.                
    MOVE 24                     TO WS-DESC-LEN.                  
    PERFORM 9880-FORMAT-DESC    THRU 9880-EXIT.                  
    MOVE WS-OUTPUT-DESC         TO GT-DESC.                      
    MOVE OC-ACCR-THRU-DTE       TO WS-DTE-JULIAN                 
    PERFORM CCSI-JUL-TO-GREG    THRU CCSI-JTG-EXIT               
    MOVE WS-DTE-YYX             TO WS-DTE-YMD-YY                 
    MOVE WS-DTE-MMX             TO WS-DTE-YMD-MM                 
    MOVE WS-DTE-DDX             TO WS-DTE-YMD-DD                 
    MOVE WS-DTE-YMD             TO GT-DESC(25:6)                 
    MOVE '$,.'               TO GT-DESC(31:)                  
    MOVE WS-CURR-CODE(1)        TO GT-MERCH-ORGN.                
    MOVE ZEROS                  TO GT-MERCH-NMBR.                
    MOVE TCR-BAL-PROG-ID        TO GT-BAL-PROG-ID.               
    IF  TCR-BAL-PROG-ID NOT EQUAL TO SPACE                       
        SET WS-ABP-TRANS-THRU   TO TRUE                          
    ELSE                                                         
        SET WS-ABP-TRANS-NOTHRU TO TRUE                          
    END-IF.                                                      
    MOVE SPACES                 TO WS-BAL-TYPE-TC.               
    MOVE SPACES                 TO WS-R-B-IND-TC.                
    MOVE TCR-BAL-TYPE           TO WS-BAL-TYPE-TC.               
    MOVE TCR-R-B-IND            TO WS-R-B-IND-TC.                
    MOVE 'N'                    TO WS-PRE-STMT-FLAG.             
    MOVE GENERATED-TRANSACTION  TO MONETARY-TRANSACTION.         
    MOVE WS-ORIG-CURR-DATA      TO CMT-ORIG-CURR-DATA.           
    PERFORM PROCESS-MISC-FEES  THRU  PMF-XIT.                    
    PERFORM TRANSACTION-REPORTING THRU TR-XIT.                   
    MOVE GT-TRANS-CODE          TO WS-TRAN-CODE-GL.              
    PERFORM GENERATE-GEN-TRAN-GL THRU GGTG-XIT.                  
    PERFORM GGTG-UPD-CARDH-GL THRU GUCG-XIT.                     
    PERFORM BALANCING-ACCT-ROUTINE THRU BAL-ACC-EXIT.            
    ADD 1 TO WS-GPS861-REF-SEQ                                   
        ON SIZE ERROR     MOVE 1 TO WS-GPS861-REF-SEQ            
                          ADD  1 TO WS-GPS861-REF-BATCH.         
    MOVE MONETARY-TRANSACTION                                    
                                TO GENERATED-TRANSACTION.        
    MOVE CMT-INSTALLMENT-IND    TO GT-INSTALLMENT-IND.           
    MOVE  3                     TO WS-HIST-SW.                   
    PERFORM HISTORY-UPDATE THRU HU-XIT.                          
GMFT-XIT.                                                        
    EXIT.                                                        
9880-FORMAT-DESC.                                                
                                                                 
    MOVE SPACES                 TO WS-OUTPUT-DESC.               
    PERFORM VARYING WS-IDX FROM WS-DESC-LEN BY -1                
      UNTIL WS-IDX < 1                                           
      COMPUTE  WS-IDX-6 = WS-DESC-LEN - WS-IDX                   
      EVALUATE TRUE  ALSO TRUE                                   
          WHEN WS-INPUT-DESC (WS-IDX:1) = X'0E' ALSO             
               (WS-IDX-6 IS LESS THAN 3 AND NOT LESS THAN 0)     
               COMPUTE WS-POSITION = WS-IDX - 1                  
               MOVE WS-INPUT-DESC (1:WS-POSITION)                
                 TO WS-OUTPUT-DESC(1:WS-POSITION)                
               GO TO 9880-EXIT                                   
          WHEN WS-INPUT-DESC (WS-IDX:1) = X'0E' ALSO             
               WS-IDX-6 > 2                                      
               COMPUTE WS-EVEN-FLAG = FUNCTION MOD (WS-IDX-6 2)  
               IF WS-EVEN-FLAG IS  EQUAL TO 0                    
                  MOVE WS-INPUT-DESC (1:WS-DESC-LEN - 2)         
                    TO WS-OUTPUT-DESC(1:WS-DESC-LEN - 2)         
                  MOVE X'0F'                                     
                    TO WS-OUTPUT-DESC(WS-DESC-LEN - 1:1)         
               ELSE                                              
                  MOVE WS-INPUT-DESC (1:WS-DESC-LEN - 1)         
                    TO WS-OUTPUT-DESC(1:WS-DESC-LEN - 1)         
                  MOVE X'0F'                                     
                    TO WS-OUTPUT-DESC(WS-DESC-LEN:1)             
               END-IF                                            
               GO TO 9880-EXIT                                   
          WHEN WS-INPUT-DESC (WS-IDX:1) = X'0F' ALSO ANY         
               MOVE WS-INPUT-DESC (1:WS-DESC-LEN)                
                 TO WS-OUTPUT-DESC(1:WS-DESC-LEN)                
               GO TO 9880-EXIT                                   
       END-EVALUATE                                              
       IF WS-IDX IS EQUAL TO 1 AND                               
          WS-INPUT-DESC (WS-IDX:1) IS NOT EQUAL TO X'0E'         
          MOVE WS-INPUT-DESC (1:WS-DESC-LEN)                     
            TO WS-OUTPUT-DESC(1:WS-DESC-LEN)                     
       END-IF                                                    
    END-PERFORM.                                                 
9880-EXIT.                                                       
    EXIT.                                                        
