BB000-FUNCB.                                                     
                                                                 
    IF ((CM-CORP-ACCT-NMBR IS NOT EQUAL TO LOW-VALUE ) AND       
       ( CM-CORP-ACCT-NMBR IS NOT EQUAL TO ZEROS ) AND           
       ( CM-CORP-ACCT-NMBR IS NOT EQUAL TO ZEROS ))              
    AND CM-ORG-NMBR       IS NOT EQUAL TO ZEROS                  
    AND CM-ORG-NMBR       IS NOT EQUAL TO 999                    
        MOVE SPACES                TO GPCORPX-RECORD             
        MOVE CM-KEY                TO GPCORPX-ACCT-NMBR          
        MOVE CM-CORP-ACCT-NUMBER   TO GPCORPX-CORP-ACCT-NUMBER   
        WRITE GPCORPX-RECORD                                     
        IF   WS-GPCORPX-STATUS NOT = '00'                        
             MOVE 00100                   TO WS-ABEND-CODE       
             MOVE WS-GPCORPX-STATUS       TO WS-ABEND-STATUS     
             MOVE 'GPCORPX WRITE ERROR'   TO WS-ABENDMSG         
             PERFORM CCSI-ABEND           THRU CCSI-ABEND-EXIT   
        END-IF                                                   
    END-IF.                                                      
                                                                 
BB000-EXIT.                                                      
    EXIT.                                                        
BD000-FUNCD.                                                     
    IF  CM-ORG-NMBR       IS NOT EQUAL TO ZEROS                  
    AND CM-ORG-NMBR       IS NOT EQUAL TO 999                    
    AND ((CM-CORP-ACCT-NMBR IS NOT EQUAL TO LOW-VALUE )          
    AND ( CM-CORP-ACCT-NMBR IS NOT EQUAL TO ZEROS )              
    AND ( CM-CORP-ACCT-NMBR IS NOT EQUAL TO SPACE ))             
        MOVE SPACES                TO CPCORPCR-RECORD            
        MOVE CM-CORP-ACCT-NUMBER   TO CPCORPCR-CORP-ACCT-NUMBER  
        MOVE CM-CUSTOMER-NUMBER    TO CPCORPCR-CUSTOMER-NUMBER   
        MOVE CM-KEY                TO CPCORPCR-KEY               
        MOVE CM-CURR-BALANCE       TO CPCORPCR-CURR-BALANCE      
        MOVE CM-SHORT-NAME         TO CPCORPCR-SHORT-NAME        
        MOVE CM-DOMICILE-BRANCH    TO CPCORPCR-DOMICILE-BRANCH   
        WRITE CPCORPCR-RECORD                                    
        IF  WS-CPCORPCR-STATUS NOT = '00'                        
            MOVE 00103                   TO WS-ABEND-CODE        
            MOVE WS-CPCORPCR-STATUS      TO WS-ABEND-STATUS      
            MOVE 'CPCORPCR WRITE ERROR'  TO WS-ABENDMSG          
            PERFORM CCSI-ABEND           THRU CCSI-ABEND-EXIT    
        END-IF                                                   
    END-IF.                                                      
                                                                 
BD000-EXIT.                                                      
    EXIT.                                                        
