GPS020-CHK-BDP.                                                  
    IF  PAYMENT                                                  
        COMPUTE  WS-BACK-DTE-RTL = WS-RTL-NET-PYMT               
        COMPUTE  WS-BACK-DTE-CASH = WS-CASH-NET-PYMT.            
    IF  PYMT-RTL-PORTION                                         
        COMPUTE WS-PYMT ROUNDED = WS-BACK-DTE-RTL                
    ELSE                                                         
        COMPUTE WS-PYMT ROUNDED  = WS-BACK-DTE-CASH.             
    IF  WS-PYMT GREATER THAN ZERO                                
        PERFORM BACK-DATE-INTEREST THRU BDI-XIT.                 
GPS020-CB-EXIT.                                                  
    EXIT.                                                        
GPS020-CALC-GRACE-DAYS.                                          
    IF  CM-DTE-LST-STMT IS NOT EQUAL TO ZEROES                   
        IF  TCM-DUE-DAYS-CALC-FLAG IS EQUAL TO 1                 
            COMPUTE WS-GRACE-DUE-DAYS = TCM-GRACE-DAYS -         
                                        TCM-DUE-DAYS             
            MOVE CM-DTE-PYMT-DUE        TO WS-DTE-JULIAN         
            MOVE 'D'                    TO WS-DTE-PERIOD         
            MOVE WS-GRACE-DUE-DAYS      TO WS-DTE-FREQ           
            PERFORM CCSI-FUTURE-DATE  THRU CCSI-FD-EXIT          
            MOVE WS-DTE-JULIAN          TO WS-CM-GRACE-DTE       
        ELSE                                                     
        MOVE CM-DTE-LST-STMT         TO WS-DTE-JULIAN            
        MOVE 'D'                     TO WS-DTE-PERIOD            
        MOVE CM-TCM-GRACE-DAYS       TO WS-DTE-FREQ              
        PERFORM CCSI-FUTURE-DATE     THRU CCSI-FD-EXIT           
        MOVE WS-DTE-JULIAN           TO WS-CM-GRACE-DTE          
        END-IF                                                   
    ELSE                                                         
        MOVE ZEROES                  TO WS-CM-GRACE-DTE.         
GPS020-CGD-EXIT.                                                 
    EXIT.                                                        
